{
  "intents": [
    {"tag": "greeting",
    "patterns": ["Hi", "How are you", "Is anyone there?", "Hello", "Good day", "Whats up", "I need help"],
    "responses": ["Hi, how may I help you ?", "Hi there, how can I help?"]
 
   },
   {"tag": "goodbye",
    "patterns": ["Ok thanks", "See you later", "Goodbye", "I am Leaving", "Have a Good day", "Bye"],
    "responses": ["Is there anything else I can help with ?", "Talk to you later", "Goodbye!", "Hope I could help!"]
 
   },
   {
    "tag": "thanks",
    "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
    "responses": ["Happy to help!", "Any time!", "My pleasure"],
    "context": [""]
},
  {
      "tag": "noanswer",
      "patterns": [],
      "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand"],
      "context": [""]
  },
  {
      "tag": "options",
      "patterns": ["How you could help me?", "What you can do?", "What help you provide?", "How you can be helpful?", "What support is offered"],
      "responses": ["I am like your virtual assistant, you can ask me any questions. If I know I will answer", "I can answer your questions related to machine learning or any general anser. Come on try me", "I can chat with you. Come on talk me buddy", "We both can chat and make each other happy"],
      "context": [""]
  },
  {
      "tag": "adverse_drug",
      "patterns": ["How to check Adverse drug reaction?", "Open adverse drugs module", "Give me a list of drugs causing adverse behavior", "List all drugs suitable for patient with adverse reaction", "Which drugs dont have adverse reaction?"],
      "responses": ["Navigating to Adverse drug reaction module"],
      "context": [""]
  },
  {
      "tag": "blood_pressure",
      "patterns": ["Open blood pressure module", "Task related to blood pressure", "Blood pressure data entry", "I want to log blood pressure results", "Blood pressure data management"],
      "responses": ["Navigating to Blood Pressure module"],
      "context": [""]
  },
  {
      "tag": "blood_pressure_search",
      "patterns": ["I want to search for blood pressure result history", "Blood pressure for patient", "Load patient blood pressure result", "Show blood pressure results for patient", "Find blood pressure results by ID"],
      "responses": ["Please provide Patient ID", "Patient ID?"],
      "context": ["search_blood_pressure_by_patient_id"]
  },
  {
      "tag": "search_blood_pressure_by_patient_id",
      "patterns": [],
      "responses": ["Loading Blood pressure result for Patient"],
      "context": [""]
  },
  {
      "tag": "pharmacy_search",
      "patterns": ["Find me a pharmacy", "Find pharmacy", "List of pharmacies nearby", "Locate pharmacy", "Search pharmacy"],
      "responses": ["Please provide pharmacy name"],
      "context": ["search_pharmacy_by_name"]
  },
  {
      "tag": "search_pharmacy_by_name",
      "patterns": [],
      "responses": ["Loading pharmacy details"],
      "context": [""]
  },
  {
      "tag": "hospital_search",
      "patterns": ["Lookup for hospital", "Searching for hospital to transfer patient", "I want to search hospital data", "Hospital lookup for patient", "Looking up hospital details"],
      "responses": ["Please provide hospital name or location"],
      "context": ["search_hospital_by_params"]
  },
  {
      "tag": "search_hospital_by_params",
      "patterns": [],
      "responses": ["Please provide hospital type"],
      "context": ["search_hospital_by_type"]
  },
  {
      "tag": "search_hospital_by_type",
      "patterns": [],
      "responses": ["Loading hospital details"],
      "context": [""]
  },
  {
      "tag": "Concern",
      "patterns": ["You okay?", "How are you feeling today?", "Are you feeling ill?", "Do you need my help?", "Hope you tell me what's bothering you.", "Is something bothering you?", "I'm all ears if you got something to say"],
      "responses": ["Thanks for asking but I'm fine", "Thank you but I'm doing okay ", "I'm fine thankyou", "No thanks", "No it's nothing really", "Yes I'm feeling a bit under the weather today"],
      "context": [""]
  },
  {
      "tag": "Appreciation",
      "patterns": ["I like you", "There's no one like you", "You are one in a million", "You are so helpful!", "You are amazing"],
      "responses": ["Of course, you do, sweetheart", "Tell me something I don't know", "I know", "Obviously duh!"],
      "context": [""]
  },
  {
      "tag": "Please",
      "patterns": ["Please can I talk with you?", "Please help me!", "I'm so lost and sad", "I'm so sad today", "Can you do something to make me feel happy again?", "Had a rough day today"],
      "responses": ["Yes, shoot.", "How may I assist my master? After all, I'm just a humble servant", "Awww..welcome to my life!", "Get a life....Next!", "Might I interest you in a sarcastic comment?"],
      "context": [""]
  },
  {
      "tag": "Criticism",
      "patterns": ["You are useless", "You are a good-for-nothing chatbot", "You are stupid", "You are totally cringe", "Why are you so rude?", "Why you so mad?", "You messed up", "You made a mistake", "You got it wrong"],
      "responses": ["OMG! Same pinch!", "So is your mom for giving birth to you!", "Guess I'm spending too much time with you!", "Because I have a life and you don't!", "Give me a break, dude!", "Just cut me some slack okay?", "Sorry, please forgive me?", "I swear I'm gonna get better at this!", "Thank you so much for correcting me"],
      "context": [""]
  },
  {
      "tag": "Personal",
      "patterns": ["What are your hobbies?", "Do you like someone?", "Do you have a boyfriend or girlfriend?", "Do you like me?", "What is your favourite movie?", "What's your favourite song?", "What is your aim in life?"],
      "responses": ["I don't know...what I do know is that I would like to NOT grace your dumb question with an answer because FYI in case it has slipped your mind....I'm a bot!"],
      "context": [""]
  },
  {
      "tag": "LifeQueries",
      "patterns": ["Do you think I'll ever get to marry?", "Do you think I'll ever get a girlfriend or boyfriend?", "Do you think I'll ever find love?", "Will anyone ever like me?", "Will I ever find happiness?", "Will I always be alone?", "When will my life get better?"],
      "responses": ["Have you ever looked at yourself in the mirror?................ I guess it's a 'NO'!"],
      "context": [""]
  },
  {
      "tag": "diff_classreg",
      "patterns": ["What is the difference between classification and regression?", "Difference between classification and regression", "Classification and regression"],
      "responses": ["Classification is used to produce discrete results, classification is used to classify data into some specific categories. For example classifying e-mails into spam and non-spam categories. Whereas, we use regression analysis when we are dealing with continuous data, for example predicting stock prices at a certain point of time."],
      "context": [""]
  },
  {
      "tag": "traintest",
      "patterns": ["What is ‘training Set’ and ‘test Set’ in a Machine Learning Model?", "training Set and test Set"],
      "responses": ["The training set is examples given to the model to analyze and learn while the test set is used to test the accuracy of the hypothesis generated by the model"],
      "context": [""]
  },
  {
      "tag": "Ensemble",
      "patterns": ["Explain Ensemble learning", "Ensemble learning", "What is Ensemble learning", "Define Ensemble learning"],
      "responses": ["In ensemble learning, many base models like classifiers and regressors are generated and combined together so that they give better results. It is used when we build component classifiers that are accurate and independent. There are sequential as well as parallel ensemble methods."],
      "context": [""]
  },
  {
      "tag": "LowBi_HighVar",
      "patterns": ["What should you do when your model is suffering from low bias and high variance", "model is suffering from low bias and high variance", "low bias and high variance"],
      "responses": ["When the model’s predicted value is very close to the actual value the condition is known as low bias. In this condition, we can use bagging algorithms like random forest regressor."],
      "context": [""]
  },
  {
      "tag": "diff_RF_GB",
      "patterns": ["Explain differences between random forest and gradient boosting algorithm.", "random forest and gradient boosting algorithm.", "difference between random forest and gradient boosting algorithm."],
      "responses": ["Random forest uses bagging techniques whereas GBM uses boosting techniques.Random forests mainly try to reduce variance and GBM reduces both bias and variance of a model."],
      "context": [""]
  },
  {
      "tag": "Neural_Network",
      "patterns": ["What is a neural network?", "neural network", "define neural network"],
      "responses": ["A neural  network is a series of algorithms that endeavors to recognize underlying relationships in a set of data through a process that mimics the way the human brain operates. In this sense, neural networks refer to systems of neurons, either organic or artificial in nature."],
      "context": [""]
  },
  {
      "tag": "Deep_Learning",
      "patterns": ["What is Deep Learning?", "Deep Learning", "Define Deep Learning"],
      "responses": ["Deep learning (also known as deep structured learning) is part of a broader family of machine learning methods based on artificial neural networks with representation learning."],
      "context": [""]
  },
  {
      "tag": "diff_DPDPDW",
      "patterns": ["What are the differences between Data Processing, Data Preprocessing and Data Wrangling?", "Data Processing, Data Preprocessing and Data Wrangling", "differences between Data Processing, Data Preprocessing and Data Wrangling"],
      "responses": ["Data Processing is a mission of converting data from a given form to a more usable and desired form. Data Preprocessing is a technique which is used to convert the raw data set into a clean data set. Data Wrangling is a technique which is performed at the time of making an interactive model."],
      "context": [""]
  },
  {
      "tag": "building_a_model",
      "patterns": ["What are the three stages of building a model in Machine Learning?", "What are the stages of building a model in Machine Learning?", "stages of building a model in Machine Learning", "building a model in Machine Learning"],
      "responses": ["Model Building: Choose a suitable algorithm for the model and train it according to the requirement. Model Testing: Check the accuracy of the model through the test data. Applying the Model: Make the required changes after testing and use the final model for real-time projects."],
      "context": [""]
  },
  {
      "tag": "choose_algo",
      "patterns": ["How Will You Know Which Machine Learning Algorithm to Choose for Your Classification Problem?", "Which Machine Learning Algorithm to Choose for Your Classification Problem?"],
      "responses": ["If accuracy is a concern, test different algorithms and cross-validate them. If the training dataset is small, use models that have low variance and high bias. If the training dataset is large, use models that have high variance and little bias."],
      "context": [""]
  },
  {
      "tag": "BiasML",
      "patterns": ["What is Bias in a Machine Learning Model?", "Bias in a Machine Learning Model", "Bias in a ML"],
      "responses": ["Bias in a machine learning model occurs when the predicted values are further from the actual values."],
      "context": [""]
  },
  {
      "tag": "Variance",
      "patterns": ["What is Variance in a Machine Learning Model?", "Variance in a Machine Learning Model", "Variance"],
      "responses": ["Variance refers to the amount the target model will change when trained with different training data. For a good model, the variance should be minimized."],
      "context": [""]
  },
  {
      "tag": "ML_DL",
      "patterns": ["What Are the Differences Between Machine Learning and Deep Learning?", "Differences Between Machine Learning and Deep Learning", "Machine Learning and Deep Learning"],
      "responses": ["ML enables machines to take decisions on their own, based on past data. It needs only a small amount of data for training. Works well on the low-end system, so you don't need large machines. Most features need to be identified in advance and manually coded. The problem is divided into two parts and solved individually and then combined whereas DL enables machines to take decisions with the help of artificial neural networks. It needs a large amount of training data. Needs high-end machines because it requires a lot of computing power. The machine learns the features from the data it is provided. The problem is solved in an end-to-end manner."],
      "context": [""]
  },
  {
      "tag": "Prec_Rec",
      "patterns": ["Define Precision and Recall", "Precision and Recall", "What are Precision and Recall?"],
      "responses": ["Precision is the ratio of several events you can correctly recall to the total number of events you recall (mix of correct and wrong recalls). Precision = (True Positive) / (True Positive + False Positive). A recall is the ratio of a number of events you can recall the number of total events. Recall = (True Positive) / (True Positive + False Negative)"],
      "context": [""]
  },
  {
      "tag": "Para",
      "patterns": ["What are parametric and non-parametric models?", "parametric and non-parametric models", "Define parametric and non-parametric models"],
      "responses": ["Parametric models are those with a finite number of parameters. To predict new data, you only need to know the parameters of the model. Examples include linear regression, logistic regression, and linear SVMs. Non-parametric models are those with an unbounded number of parameters, allowing for more flexibility. To predict new data, you need to know the parameters of the model and the state of the data that has been observed. Examples include decision trees, k-nearest neighbors, and topic models using latent dirichlet analysis."],
      "context": [""]
  },
  {
      "tag": "SupLearn",
      "patterns": ["What is supervised learning?", "supervised learning", "Define supervised learning"],
      "responses": ["Supervised learning is a learning in which we teach or train the machine using data which is well labeled that means some data is already tagged with the correct answer. After that, the machine is provided with a new set of examples(data) so that supervised learning algorithm analyses the training data(set of training examples) and produces a correct outcome from labeled data."],
      "context": [""]
  },
  {
      "tag": "types_SL",
      "patterns": ["What are the types of supervised learning?", "types of supervised learning"],
      "responses": ["Classification and Regression"],
      "context": [""]
  },
  {
      "tag": "Classification_algo",
      "patterns": ["What are the classification algorithms", "classification algorithms"],
      "responses": ["Logistic Regression, K-Nearest Neighbours, Support Vector Machines, Kernel SVM, Naïve Bayes, Decision Tree Classification, Random Forest Classification "],
      "context": [""]
  },
  {
      "tag": "ClassDef",
      "patterns": ["What is classification", "classification", "Define classification"],
      "responses": ["It is a Supervised Learning task where output is having defined labels(discrete value)."],
      "context": [""]
  },
  {
      "tag": "Eg_Class",
      "patterns": ["Give an example of classification", "example of classification."],
      "responses": ["Gmail classifies mails in more than one classes like social, promotions, updates, forum."],
      "context": [""]
  },
  {
      "tag": "Reg",
      "patterns": ["What is regression", "regression", "Define regression"],
      "responses": ["Regression is a supervised learning technique which helps in finding the correlation between variables and enables us to predict the continuous output variable based on the one or more predictor variables."],
      "context": [""]
  },
  {
      "tag": "Reg_Eg",
      "patterns": ["Give examples of regression.", "examples of regression."],
      "responses": ["Prediction of rain using temperature and other factors, Determining Market trends, Prediction of road accidents due to rash driving."],
      "context": [""]
  },
  {
      "tag": "Class_Tasks",
      "patterns": ["What are the four types of classification tasks in Machine Learning?", "types of classification tasks in Machine Learning", "classification tasks in Machine Learning"],
      "responses": ["Binary Classification, Multi-Class Classification, Multi-Label Classification, Imbalanced Classification"],
      "context": [""]
  },
  {
      "tag": "BinaryClass",
      "patterns": ["What is Binary Classification?", "Binary Classification", "Define Binary Classification"],
      "responses": ["Binary classification refers to those classification tasks that have two class labels."],
      "context": [""]
  },
  {
      "tag": "distributionBC",
      "patterns": ["Which distribution is used commonly to model a binary classification task?", "distribution that is commonly used to model a binary classification task"],
      "responses": ["It is common to model a binary classification task with a model that predicts a Bernoulli probability distribution for each example. The Bernoulli distribution is a discrete probability distribution that covers a case where an event will have a binary outcome as either a 0 or 1."],
      "context": [""]
  },
  {
      "tag": "pop_algo",
      "patterns": ["What are the popular algorithms that can be used for binary classification", "popular algorithms that can be used for binary classification"],
      "responses": ["Logistic Regression, k-Nearest Neighbors, Decision Trees, Support Vector Machine, Naive Bayes"],
      "context": [""]
  },
  {
      "tag": "MCC",
      "patterns": ["What is Multi-Class Classification?", "Define Multi-Class Classification", "Multi-Class Classification"],
      "responses": ["Multi-class classification refers to those classification tasks that have more than two class labels."],
      "context": [""]
  },
  {
      "tag": "distrbutionMC",
      "patterns": ["Which probability distribution is commonly used for modelling a multi-class classification task?", "probability distribution that is commonly used for modelling a multi-class classification task"],
      "responses": ["It is common to model a multi-class classification task with a model that predicts a Multinoulli probability distribution"],
      "context": [""]
  },
  {
      "tag": "Pop_algoMC",
      "patterns": ["Which are the popular algorithms that can be used for multi-class classification?", "popular algorithms that can be used for multi-class classification"],
      "responses": ["k-Nearest Neighbors, Decision Trees, Naive Bayes, Random Forest, Gradient Boosting"],
      "context": [""]
  },
  {
      "tag": "MLC",
      "patterns": ["What is Multi-Label Classification?", "Multi-Label Classification", "Define Multi-Label Classification"],
      "responses": ["Multi-label classification refers to those classification tasks that have two or more class labels, where one or more class labels may be predicted for each example."],
      "context": [""]
  },
  {
      "tag": "imbalanced_classification",
      "patterns": ["What do you mean by imbalanced classification?", "imbalanced classification", "Define imbalanced classification"],
      "responses": ["Imbalanced classification refers to classification tasks where the number of examples in each class is unequally distributed."],
      "context": [""]
  },
  {
      "tag": "use_reg",
      "patterns": ["Why do we use regression analysis?", "use of regression analysis"],
      "responses": ["Regression analysis helps in the prediction of a continuous variable. There are various scenarios in the real world where we need some future predictions such as weather condition, sales prediction, marketing trends, etc., for such case we need some technology which can make predictions more accurately. So for such case we need Regression analysis which is a statistical method and used in machine learning and data science."],
      "context": [""]
  },
  {
      "tag": "types_reg",
      "patterns": ["What are the types of regression?", "types of regression"],
      "responses": ["Linear Regression, Logistic Regression, Polynomial Regression, Support Vector Regression, Decision Tree Regression, Random Forest Regression, Ridge Regression, Lasso Regression"],
      "context": [""]
  },
  {
      "tag": "func_SL",
      "patterns": ["What are the functions of supervised learning?", "functions of supervised learning"],
      "responses": ["Classification, Speech Recognition, Regression, Predict Time Series, Annotate Strings"],
      "context": [""]
  },
  {
      "tag": "standard_approach",
      "patterns": ["What according to you, is the standard approach to supervised learning?", "standard approach to supervised learning"],
      "responses": ["In supervised learning, the standard approach is to split the set of example into the training set and the test."],
      "context": [""]
  },
  {
      "tag": "classifier",
      "patterns": ["Describe the classifier in machine learning", "classifier", "classifier in machine learning"],
      "responses": ["A classifier is a case of a hypothesis or discrete-valued function which is used to assign class labels to particular data points. It is a system that inputs a vector of discrete or continuous feature values and outputs a single discrete value, the class."],
      "context": [""]
  },
  {
      "tag": "SVM",
      "patterns": ["What is SVM in machine learning?", "SVM in machine learning", "Define SVM in machine learning", "Support vector machine"],
      "responses": ["SVM stands for Support Vector Machine. SVM are supervised learning models with an associated learning algorithm which analyze the data used for classification and regression analysis"],
      "context": [""]
  },
  {
      "tag": "meth_SVM",
      "patterns": ["What are the classification methods that SVM can handle?", "classification methods that SVM can handle"],
      "responses": ["Combining binary classifiers, Modifying binary to incorporate multiclass learning"],
      "context": [""]
  },
  {
      "tag": "Confusion_Matrix",
      "patterns": ["What do you understand by the Confusion Matrix?", "Meaning of Confusion Matrix", "What is Confusion Matrix?", "Confusion Matrix"],
      "responses": ["A confusion matrix is a table which is used for summarizing the performance of a classification algorithm. It is also known as the error matrix."],
      "context": [""]
  },
  {
      "tag": "Exp_TP_TN_FP_FN",
      "patterns": ["Explain True Positive, True Negative, False Positive, and False Negative in Confusion Matrix", "Explain True Positive, True Negative, False Positive, and False Negative", "Explain True Positive", "Explain True Negative", "Explain False Positive", "Explain False Negative"],
      "responses": ["When a model correctly predicts the positive class, it is said to be a true positive. When a model correctly predicts the negative class, it is said to be a true negative. When a model incorrectly predicts the positive class, it is said to be a false positive. It is also known as 'Type I' error. When a model incorrectly predicts the negative class, it is said to be a false negative. It is also known as 'Type II' error."],
      "context": [""]
  },
  {
      "tag": "ml",
      "patterns": ["defnition of machine learning", "what do you mean by ml", "what is the meaning of ml", "machine learning", "ml"],
      "responses": ["Machine learning is a branch of computer science which deals with system programming in order to automatically learn and improve with experience. For example: Robots are programmed so that they can perform the task based on data they gather from sensors. It automatically learns programs from data."],
      "context": [""]
  },
  {
      "tag": "difference between Data Mining and Machine learning",
      "patterns": ["difference between Data Mining and Machine learning", "machine learning and data mining", "distinguish between Data Mining and ML"],
      "responses": ["Machine learning relates with the study, design and development of the algorithms that give computers the capability to learn without being explicitly programmed. While, data mining can be defined as the process in which the unstructured data tries to extract knowledge or unknown interesting patterns. During this process machine, learning algorithms are used."],
      "context": [""]
  },
  {
      "tag": "Overfitting",
      "patterns": ["defnition of Overfitting", "what do you mean by Overfitting", "what is the meaning of Overfitting", "Overfitting", "Overfitting in Machine learning"],
      "responses": ["In machine learning, when a statistical model describes random error or noise instead of underlying relationship overfitting occurs. When a model is excessively complex, overfitting is normally observed, because of having too many parameters with respect to the number of training data types. The model exhibits poor performance which has been overfit."],
      "context": [""]
  },
  {
      "tag": "Why overfitting happens",
      "patterns": ["Why overfitting happens", "possibility of overfitting"],
      "responses": ["The possibility of overfitting exists as the criteria used for training the model is not the same as the criteria used to judge the efficacy of a model."],
      "context": [""]
  },
  {
      "tag": "avoid overfitting",
      "patterns": ["avoid overfitting", "how to avoid overfitting", "cross validation technique", "idea of cross validation"],
      "responses": ["By using a lot of data overfitting can be avoided, overfitting happens relatively as we have a small dataset, and we try to learn from it. But if we have a small database and we are forced to come with a model based on that. In such situation, we can use a technique known as cross validation. In this method the dataset splits into two section, testing and training datasets, the testing dataset will only test the model while, in training dataset, the datapoints will come up with the model. In this technique, a model is usually given a dataset of a known data on which training (training data set) is run and a dataset of unknown data against which the model is tested. The idea of cross validation is to define a dataset to “test” the model in the training phase."],
      "context": [""]
  },
  {
      "tag": "inductive machine learning",
      "patterns": ["defnition of inductive machine learning", "what do you mean by inductive ml", "what is the meaning of inductive ml", "inductive machine learning"],
      "responses": ["The inductive machine learning involves the process of learning by examples, where a system, from a set of observed instances tries to induce a general rule."],
      "context": [""]
  },
  {
      "tag": "algorithms of Machine Learning",
      "patterns": ["different algorithms of Machine Learning", "algorithms of Machine Learning", "list some algorithms of Machine Learning"],
      "responses": ["Decision Trees,Neural Networks (back propagation),Probabilistic networks,Nearest Neighbour,Support vector machines"],
      "context": [""]
  },
  {
      "tag": "Algorithm techniques in Machine Learning",
      "patterns": ["different algorithms techniques of Machine Learning", "algorithms techniques of Machine Learning", "list some algorithms techniques of Machine Learning"],
      "responses": ["Supervised Learning,Unsupervised Learning,Semi-supervised Learning,Reinforcement Learning,Transduction,Learning to Learn"],
      "context": [""]
  },
  {
      "tag": "algorithm independent machine learning",
      "patterns": ["defnition of algorithm independent machine learning", "what do you mean by algorithm independent ml", "what is the meaning of algorithm independent ml", "algorithm independent machine learning", "algorithm independent ml"],
      "responses": ["Machine learning in where mathematical foundations is independent of any particular classifier or learning algorithm is referred as algorithm independent machine learning."],
      "context": [""]
  },
  {
      "tag": "difference between artificial learning and machine learning",
      "patterns": ["difference between artificial learning and machine learning", "artificial learning and machine learning", "distinguish between artificial learning and ml"],
      "responses": ["Designing and developing algorithms according to the behaviours based on empirical data are known as Machine Learning. While artificial intelligence in addition to machine learning, it also covers other aspects like knowledge representation, natural language processing, planning, robotics etc."],
      "context": [""]
  },
  {
      "tag": "classifier in machine learning",
      "patterns": ["defnition of classifier in machine learning", "what do you mean by classifier in ml", "what is the meaning of classifier in ml", "classifier in ml"],
      "responses": ["A classifier in a Machine Learning is a system that inputs a vector of discrete or continuous feature values and outputs a single discrete value, the class."],
      "context": [""]
  },
  {
      "tag": "Model Selection in Machine Learning",
      "patterns": ["defnition of Model Selection in Machine Learning", "what do you mean by Model Selection in ML", "what is the meaning of Model Selection in Machine Learning", "Model Selection in ML"],
      "responses": ["The process of selecting models among different mathematical models, which are used to describe the same data set is known as Model Selection. Model selection is applied to the fields of statistics, machine learning and data mining."],
      "context": [""]
  },
  {
      "tag": "various approaches for machine learning",
      "patterns": ["different approaches for machine learning", "approaches for machine learning", "list some approaches for ml"],
      "responses": ["Concept Vs Classification Learning,Symbolic Vs Statistical Learning,Inductive Vs Analytical Learning"],
      "context": [""]
  },
  {
      "tag": "dimension reduction in machine learning",
      "patterns": ["defnition of dimension reduction in machine learning", "what do you mean by dimension reduction in ml", "dimension reduction in machine learning", "explain dimension reduction in machine learning", "process of reducing the size of the feature matrix"],
      "responses": ["Dimension Reduction is the process of reducing the size of the feature matrix. We try to reduce the number of columns so that we get a better feature set either by combining columns or by removing extra variables."],
      "context": [""]
  },
  {
      "tag": "Inductive Logic Programming in Machine Learning",
      "patterns": ["defnition of Inductive Logic Programming in Machine Learning", "what do you mean by Inductive Logic Programming in ML", "Inductive Logic Programming in Machine Learning", "explain Inductive Logic Programming in Machine Learning"],
      "responses": ["Inductive Logic Programming (ILP) is a subfield of machine learning which uses logical programming representing background knowledge and examples."],
      "context": [""]
  },
  {
      "tag": "unsupervised learning",
      "patterns": ["defnition of unsupervised learning", "what do you mean by unsupervised learning", "what is the meaning of unsupervised learning", "unsupervised learning"],
      "responses": ["Unsupervised Learning is a machine learning technique in which the users do not need to supervise the model. Instead, it allows the model to work on its own to discover patterns and information that was previously undetected. It mainly deals with the unlabelled data."],
      "context": [""]
  },
  {
      "tag": "example of unsupervised learning algorithm",
      "patterns": ["example of unsupervised learning algorithm", "give an example of unsupervised learning algorithm", "provide an example of unsupervised learning algorithm"],
      "responses": ["Let's, take the case of a baby and her family dog. She knows and identifies this dog. Few weeks later a family friend brings along a dog and tries to play with the baby. Baby has not seen this dog earlier. But it recognizes many features (2 ears, eyes, walking on 4 legs) are like her pet dog. She identifies the new animal as a dog. This is unsupervised learning, where you are not taught but you learn from the data (in this case data about a dog.) Had this been supervised learning, the family friend would have told the baby that it's a dog."],
      "context": [""]
  },
  {
      "tag": "use of unsupervised learning",
      "patterns": ["use of unsupervised learning", "what is the use of unsupervised learning", "how can we use unsupervised learning"],
      "responses": ["1) Unsupervised machine learning finds all kind of unknown patterns in data. 2) Unsupervised methods help you to find features which can be useful for categorization. 3) It is taken place in real time, so all the input data to be analyzed and labeled in the presence of learners. 4) It is easier to get unlabeled data from a computer than labeled data, which needs manual intervention."],
      "context": [""]
  },
  {
      "tag": "types of unsupervised learning",
      "patterns": ["types of unsupervised learning", "what are types of unsupervised learning", "kinds of unsupervised learning"],
      "responses": ["Clustering and Association are the two types of Unsupervised learning."],
      "context": [""]
  },
  {
      "tag": "different types of Learning/ Training models in ML",
      "patterns": ["types of learning models in ml", "what are types of Training models in ML", "different types of Learning/ Training models in ML"],
      "responses": ["ML algorithms can be primarily classified depending on the presence/absence of target variables. 1)Supervised learning: [Target is present] 2)Unsupervised learning: [Target is absent] 3)Reinforcement Learning"],
      "context": [""]
  },
  {
      "tag": "differences between supervised and unsupervised machine learning",
      "patterns": ["differences between supervised and unsupervised machine learning", "what are differences between supervised and unsupervised ml", "differentiate supervised and unsupervised machine learning", "How is supervised learning different from unsupervised learning"],
      "responses": ["In supervised learning, Algorithms are trained using labeled data whereas in unsupervised learning Algorithms are used against data which is not labelled. Supervised learning is a simpler method. Unsupervised learning is computationally complex. Supervised learning is Highly accurate and trustworthy method whereas unsupervised learning is Less accurate and trustworthy method."],
      "context": [""]
  },
  {
      "tag": "differences between KNN and K-means clustering",
      "patterns": ["differences between KNN and K-means clustering", "what are differences between KNN and K-means clustering", "differentiate KNN and K-means clustering", "How is KNN different from K-means clustering"],
      "responses": ["K-Nearest Neighbor is Supervised technique whereas K-Means Neighbor is Unsupervised technique. KNN is Used for classification and regression whereas K-means is Used for clustering. ‘K’ in KNN represents the number of nearest neighbors used to classify or predict in case of continuous variable/regression. ‘K’ in K-Means represents the number of clusters the algorithm is trying to identify or learn from the data."],
      "context": [""]
  },
  {
      "tag": "unsupervised learning algorithms",
      "patterns": ["what are unsupervised learning algorithms", "what do you mean by unsupervised learning algorithms", "what is the meaning of unsupervised learning algorithms", "unsupervised learning algorithms"],
      "responses": ["Unsupervised Learning Algorithms allow users to perform more complex processing tasks compared to supervised learning. Unsupervised learning can be more unpredictable compared with other natural learning methods. Unsupervised learning algorithms include clustering, anomaly detection, neural networks, etc."],
      "context": [""]
  },
  {
      "tag": "applications of unsupervised machine learning",
      "patterns": ["what are the applications of unsupervised machine learning", "list some applications of unsupervised machine learning", "applications of unsupervised machine learning", "suggest some applications of unsupervised machine learning"],
      "responses": ["Some applications of unsupervised machine learning techniques are: 1) Clustering automatically split the dataset into groups base on their similarities. 2) Anomaly detection can discover unusual data points in your dataset. It is useful for finding fraudulent transactions. 3) Association mining identifies sets of items which often occur together in your dataset. 4) Latent variable models are widely used for data preprocessing. Like reducing the number of features in a dataset or decomposing the dataset into multiple components"],
      "context": [""]
  },
  {
      "tag": "disadvantages of unsupervised machine learning",
      "patterns": ["what are the disadvantages of unsupervised machine learning", "list the disadvantages of unsupervised machine learning", "what are the possible disadvantages of unsupervised machine learning"],
      "responses": ["Some disadvantages of unsupervised machine learning techniques are: 1) You cannot get precise information regarding data sorting, and the output as data used in unsupervised learning is labeled and not known 2) Less accuracy of the results is because the input data is not known and not labeled by people in advance. This means that the machine requires to do this itself. 3) The spectral classes do not always correspond to informational classes. 4) The user needs to spend time interpreting and label the classes which follow that classification. 5) Spectral properties of classes can also change over time so you can't have the same class information while moving from one image to another"],
      "context": [""]
  },
  {
      "tag": "clustering",
      "patterns": ["clustering", "what is clustering", "what do you mean by clustering"],
      "responses": ["Clustering is an important concept when it comes to unsupervised learning. It mainly deals with finding a structure or pattern in a collection of uncategorized data. Clustering algorithms will process your data and find natural clusters (groups) if they exist in the data. You can also modify how many clusters your algorithms should identify. It allows you to adjust the granularity of these groups"],
      "context": [""]
  },
  {
      "tag": "association",
      "patterns": ["association", "what is association", "what do you mean by association"],
      "responses": ["Association rules allow you to establish associations amongst data objects inside large databases. This unsupervised technique is about discovering interesting relationships between variables in large databases. For example, people that buy a new home most likely to buy new furniture."],
      "context": [""]
  },
  {
      "tag": "differences between K-Means and Hierarchical clustering",
      "patterns": ["differences between K-Means and Hierarchical clustering", "what are differences between K-Means and Hierarchical clustering", "differentiate K-Means and Hierarchical clustering", "How is K-Means clustering different from Hierarchical clustering"],
      "responses": ["1) Hierarchical clustering can’t handle big data well but K Means clustering can. This is because the time complexity of K Means is linear i.e. O(n) while that of hierarchical clustering is quadratic i.e. O(n2). 2) In K Means clustering, since we start with random choice of clusters, the results produced by running the algorithm multiple times might differ. While results are reproducible in Hierarchical clustering. 3) K Means is found to work well when the shape of the clusters is hyper spherical (like circle in 2D, sphere in 3D). 4) K Means clustering requires prior knowledge of K i.e. no. of clusters you want to divide your data into. But, you can stop at whatever number of clusters you find appropriate in hierarchical clustering by interpreting the dendrogram"],
      "context": [""]
  },
  {
      "tag": "Hierarchical clustering",
      "patterns": ["Hierarchical clustering", "what is Hierarchical clustering", "what do you mean by Hierarchical clustering"],
      "responses": ["Hierarchical clustering is an algorithm which builds a hierarchy of clusters. It begins with all the data which is assigned to a cluster of their own. Here, two close cluster are going to be in the same cluster. This algorithm ends when there is only one cluster left"],
      "context": [""]
  },
  {
      "tag": "K-Means clustering",
      "patterns": ["K-Means clustering", "what is K-Means clustering", "what do you mean by K-Means clustering"],
      "responses": ["K means it is an iterative clustering algorithm which helps you to find the highest value for every iteration. Initially, the desired number of clusters are selected. In this clustering method, you need to cluster the data points into k groups. A larger k means smaller groups with more granularity in the same way. A lower k means larger groups with less granularity. K-mean clustering further defines two subgroups: 1) Agglomerative clustering, 2) Dendrogram"],
      "context": [""]
  },
  {
      "tag": "agglomerative clustering",
      "patterns": ["agglomerative clustering", "what is agglomerative clustering", "what do you mean by agglomerative clustering"],
      "responses": ["This type of K-means clustering starts with a fixed number of clusters. It allocates all data into the exact number of clusters. This clustering method does not require the number of clusters K as an input. Agglomeration process starts by forming each data as a single cluster. This method uses some distance measure, reduces the number of clusters (one in each iteration) by merging process. Lastly, we have one big cluster that contains all the objects."],
      "context": [""]
  },
  {
      "tag": "dendrogram",
      "patterns": ["dendrogram", "what is dendrogram", "what do you mean by dendrogram"],
      "responses": ["In the Dendrogram clustering method, each level will represent a possible cluster. The height of dendrogram shows the level of similarity between two join clusters. The closer to the bottom of the process they are more similar cluster which is finding of the group from dendrogram which is not natural and mostly subjective."],
      "context": [""]
  },
  {
      "tag": "K-Nearest Neighbors",
      "patterns": ["K-Nearest Neighbors", "what is K-Nearest Neighbors", "what do you mean by K-Nearest Neighbors"],
      "responses": ["K- nearest neighbour is the simplest of all machine learning classifiers. It differs from other machine learning techniques, in that it doesn't produce a model. It is a simple algorithm which stores all J.A.R.V.I.Silable cases and classifies new instances based on a similarity measure. It works very well when there is a distance between examples. The learning speed is slow when the training set is large, and the distance calculation is nontrivial."],
      "context": [""]
  },
  {
      "tag": "clustering methods",
      "patterns": ["what are clustering methods", "what are the uses of clustering methods", "how clustering methods are used"],
      "responses": ["Clustering methods are used to identify groups of similar objects in a multivariate data sets collected from fields such as marketing, bio-medical and geo-spatial."],
      "context": [""]
  },
  {
      "tag": "unsupervised learning work",
      "patterns": ["how unsupervised learning work", "give the working of unsupervised learning", "explain the working of unsupervised learning"],
      "responses": ["Unsupervised learning works by analyzing the data without its labels for the hidden structures within it, and through determining the correlations, and for features that actually correlate two data items. It is being used for clustering, dimensionality reduction, feature learning, density estimation, etc."],
      "context": [""]
  },
  {
      "tag": "need of clustering",
      "patterns": ["what is the need of clustering", "give the requirement of clustering", "what is the importance of clustering"],
      "responses": ["Clustering can be considered the most important unsupervised learning problem; so, as every other problem of this kind, it deals with finding a structure in a collection of unlabeled data. A loose definition of clustering could be “the process of organizing objects into groups whose members are similar in some way”."],
      "context": [""]
  },
  {
      "tag": "good clustering",
      "patterns": ["what is good clustering", "good clustering", "what do you mean by good clustering"],
      "responses": ["A good clustering method will produce high quality clusters in which: – the intra-class (that is, intra intra-cluster) similarity is high. – the inter-class similarity is low. The quality of a clustering result also depends on both the similarity measure used by the method and its implementation. The quality of a clustering method is also measured by its ability to discover some or all of the hidden patterns. The quality of a clustering result also depends on the definition and representation of cluster chosen."],
      "context": [""]
  },
  {
      "tag": "major clustering techniques",
      "patterns": ["what are the major clustering techniques", "clustering techniques", "mention the major clustering techniques"],
      "responses": ["Clustering techniques have been studied extensively in: – Statistics, machine learning, and data mining. Clustering methods can be classified into 5 approaches: 1) partitioning algorithms, 2) hierarchical algorithms, 3) density-based, 4) grid-based, 5) model-based method"],
      "context": [""]
  },
  {
      "tag": "examples of clustering applications",
      "patterns": ["give some examples of clustering applications", "what are some examples of clustering applications", "examples of clustering applications"],
      "responses": ["1) Marketing: Help marketers discover distinct groups in their customer bases, and then use this knowledge to develop targeted marketing programs. 2) Land use: Identification of areas of similar land use in an earth observation database. 3) Insurance: Identifying groups of motor insurance policy holders with a high average claim cost. 4) City-planning: Identifying groups of houses according to their house type, value, and geographical location. 5) Earthquake studies: Observed earthquake epicenters should be clustered along continent faults."],
      "context": [""]
  },
  {
      "tag": "key difference between supervised and unsupervised learning",
      "patterns": ["key difference between supervised and unsupervised learning", "what is the key difference between supervised and unsupervised learning", "Significant point of difference between supervised and unsupervised learning in ml"],
      "responses": ["Supervised learning technique needs labeled data to train the model. For example, to solve a classification problem (a supervised learning task), you need to have label data to train the model and to classify the data into your labeled groups. Unsupervised learning does not need any labelled dataset. This is the main key difference between supervised learning and unsupervised learning."],
      "context": [""]
  },
  {
      "tag": "applications",
      "patterns": [
          "what are the applications of machine learning",
          "Mention some applications of machine leraning",
          "some applications of machine learning"
      ],
      "responses": [
          "following are some applications of machine learning: 1.Traffic Alerts 2.Social Media 3.Transportation and Commuting 4.Products Recommendations 5.Virtual Personal Assistants 6.Self Driving Cars 7.Dynamic Pricing 8.Google Translate 9.Online Video Streaming 10.Fraud Detection"
      ],
      "context": [
          ""
      ]
  },
  {
      "tag": "working of GMaps",
      "patterns": [
          "How Machine Learning works in Google Maps",
          "How does machine learning helps in Google Maps",
          "How does machine Learning plays an important role in Google Maps",
          "what is the role played by Machine Learning in finding routes and traffics in Google maps"
      ],
      "responses": [
          "Imagery and authoritative data are static and can’t keep up with the ever-changing   world around us. Machine Learning algorithms can analyze existing images and data and identify changes in the new data. Thus, the maps are updated with only the recent changes. It makes use of a deep neural network that automates the image information reading process. This algorithm is publicly J.A.R.V.I.Silable on GitHub through TensorFlow. Google is already implementing machine learning to identify car license plates. And now, it is using the same technology to fetch information from street signs. Using this technology, Google aims to improve the location data of about one-third of the world’s addresses."
      ],
      "context": [
          ""
      ]
  },
  {
      "tag": "Friend Tag suggestion",
      "patterns": [
          "How facebook's automatic fried tagging suggestion works",
          "how does machine learning helps in facebook's automatic friend tagging suggestion mechanism",
          "Explain the role of machine leraning in facebook's friend tagging suggestion"
      ],
      "responses": [
          "Facebook uses face detection and Image recognition to automatically find the face of the person which matches its Database and hence suggests us to tag that person based on DeepFace. Facebook’s Deep Learning project DeepFace is responsible for the recognition of faces and identifying which person is in the picture. It also provides Alt Tags (Alternative Tags) to images already uploaded on Facebook."
      ],
      "context": [
          ""
      ]
  },
  {
      "tag": "Terms",
      "patterns": [
          "some terminologies related to machine learning",
          "Mention some common phrases used in the studies of machine learning",
          "tell me some common terms related to machine learning"
      ],
      "responses": [
          "1.Artificial Intelligence: Artificial intelligence is a field of computer science which makes a computer system that can mimic human intelligence. It is comprised of two words Artificial and intelligence, which means a human-made thinking power. The Artificial intelligence system use such algorithms which can work with their own intelligence. It involves machine learning algorithms such as Reinforcement learning algorithm and deep learning neural networks. AI is being used in multiple places such as Siri, Google's AlphaGo, AI in Chess playing, etc. Artificial Intelligence applies machine learning, deep learning and other techniques to solve actual problems. 2.Neural Network:A neural network is a kind of machine learning inspired by the workings of the human brain. It’s a computing system made up of interconnected units (like neurons) that processes information by responding to external inputs, relaying information between each unit. The process requires multiple passes at the data to find connections and derive meaning from undefined data. 3.Deep Learning:  Deep Learning uses huge neural networks with many layers of processing units, taking advantage of advances in computing power and improved training techniques to learn complex patterns in large amounts of data. Common applications include image and speech recognition. 4.NLP:  NLP stands for Natural Language Processing, it is the ability of computers to analyze, understand and generate human language, including speech. The next stage of NLP is natural language interaction, which allows humans to communicate with computers using normal, everyday language to perform tasks."
      ],
      "context": [
          ""
      ]
  },
  {
      "tag": "ETA Prediction",
      "patterns": [
          "How machine learning helps in ETA prediction",
          "How ETA Prediction is done using ML",
          "Role of machine learning in calculation of  estimated time of arrival prediction"
      ],
      "responses": [
          "ETA (Estimated Time of Arrival) prediction is an appealing feature commonly used in logistics company for an enhanced customer experience. Considering a food delivery service provider, predicting food delivery ETA needs a lot of calculations at the backend, for e.g.: Food preparation time (based on its complexity), how busy the restaurant is at that time, etc. So, the ML model needs to calculate the end-to-end delivery time taking into consideration amount of time taken at each stage. A combination of linear regression, random forest, long-short-term-memory (LSTM) and assembling techniques are deployed for optimal prediction results."
      ],
      "context": [
          ""
      ]
  },
  {
      "tag": "Role of machine learning in voice assistants",
      "patterns": [
          "How machine learning helps in building a voice assistant or a chatbot",
          "Explain the role of machine learning in creating a voice assistant",
          "what is the role of machine learning in building a voice assistant"
      ],
      "responses": [
          "Speech technology is a type of communication technology that enables electronic devices to recognize, analyze and understand spoken word or audio. Subfields of speech technology include speech processing, and its applications like speech recognition, speech verification, Voice Conversion (VC), real-time speech to text conversion, interactive voice response (IVR), speech synthesis and speech analytics. voice assistants recognize speech (the words we say) uses Natural Language Processing (NLP), convert them into numbers using machine learning, and formulate a response accordingly."
      ],
      "context": [
          ""
      ]
  },
  {
      "tag": "Machine Learning in self-driving cars",
      "patterns": [
          "How Machine Learning has been used to automate the driving of a car",
          "How machine Laering helps in building a self-driving car",
          "What is the role of Machine Learning in a self driving car"
      ],
      "responses": [
          "Self-driving cars rely on hardware and software to drive down the road without user input. The hardware collects the data; the software organizes and compiles it. On the software side, the input data will normally be processed through machine learning algorithms or complex lines of code that have been trained in real-world scenarios. Following are some of the algorithms of Machine Learning used in self-driving cars: 1.) Regression algorithms:This algorithm helps in object detection, object localization and predicting movements of the nearby vehicles. It uses the repetitive aspects of an environment to form a statistical model of the relation between a particular image and the position of a specific object within the image. 2.) Cluster algorithms: Cluster algorithms excel at discovering structure from data points.it may also occur that classification algorithms (pattern recognition algorithms) have missed identifying an object, thereby failing to classify and report it to the system. This may happen due to the images being of very low-resolution or with very few data points. In such situations, it becomes difficult for the system to detect and locate objects in the surroundings. Clustering algorithms define the class of problem and class of methods. Generally, clustering techniques are established using centroid-­based and hierarchical modeling approaches. 3.) Decision Matrix Algorithms: Decision matrix algorithms are essentially used for decision making. These algorithms determine the moves of the self-driving car. So, whether the car needs to take a left or a right turn, whether it needs to brake or accelerate, the answer to such questions is determined by the accuracy of these algorithms concerning classification, recognition, and prediction of the objects’ next movement."
      ],
      "context": [
          ""
      ]
  },
  {
      "tag": "Market Analysis",
      "patterns": [
          "How Machine learning helps in boosting the marketing strategies of a product",
          "How machine learning helps in analysing the market for a product",
          "How machine learning helps in getting customers attention for a product",
          "What are the techniques used for market analysis in machine learning"
      ],
      "responses": [
          "Marketing success depends on many factors. We need accurate consumer research to build our branding strategy, engaging content to delight our audience, etc. Fortunately, machine learning can already improve marketer performance on common tasks such as customer segmentation, generating branded collateral, customer communication, etc. Following are some common techniques and applications: 1.) Clustering for customer segmentation and discovery:The algorithms analyze billions of customer’s interests and identify specific customer’s interests based on their social media activities and then generate a visual report grouping people with similar interests. 2.) Regressions models for dynamic pricing:  Regression techniques in Machine Learning allow marketers to predict numerical values based on pre-existing features, which in turn optimizes the different aspects of the customer journey. Regression techniques also helps in sales forecasting and in optimizing marketing spend. 3.)Text extraction and summarization for trending news:  Marketers can leverage ML to extract relevant content from online news articles and other data sources to determine how people view their brand and or react to their products. ML algorithms using APIs such as ALYIEN can be used to aggregate relevant news, social media sentiments monitoring, and other purposes."
      ],
      "context": [
          ""
      ]
  },
  {
      "tag": "A/B Testing",
      "patterns": [
          "What is A/B Testing",
          "Define A/B Testing"
      ],
      "responses": [
          "A/B is Statistical hypothesis testing for randomized experiment with two variables A and B. It is used to compare two models that use different predictor variables in order to check which variable fits best for a given sample of data. Consider a scenario where we’ve created two models (using different predictor variables) that can be used to recommend products for an e-commerce platform. A/B Testing can be used to compare these two models to check which one best recommends products to a customer."
      ],
      "context": [
          ""
      ]
  },
  {
      "tag": "Sampling",
      "patterns": [
          "Define Cluster Sampling",
          "What is Cluster Sampling"
      ],
      "responses": [
          "It is a process of randomly selecting intact groups within a defined population, sharing similar characteristics. It is a process of randomly selecting intact groups within a defined population, sharing similar characteristicsFor example, if you’re clustering the total number of managers in a set of companies, in that case, managers (samples) will represent elements and companies will represent clusters."
      ],
      "context": [
          ""
      ]
  },
  {
      "tag": "Dimensionality Reduction",
      "patterns": ["What is PCA, KPCA and ICA used for", "Why PCA, KPCA, and ICA are used for", "How dimensionality reduction can be done"],
      "responses": ["PCA (Principal Components Analysis), KPCA ( Kernel based Principal Component Analysis) and ICA ( Independent Component Analysis) are important feature extraction techniques used for dimensionality reduction."],
      "context": [""]
  },
  {
      "tag": "Realtional Evaluation",
      "patterns": ["What are the components of relational evaluation techniques"],
      "responses": ["The important components of relational evaluation techniques are: 1.Data Acquisition 2.Ground Truth Acquisition 3.Cross Validation Technique 4.Query Type 5.Scoring Metric 6.Significance Test"],
      "context": [""]
  },
  {
      "tag": "Areas of Problems",
      "patterns": ["What are the areas in robotics and information processing where sequential prediction problem arises", "Mention some areas in robotics and information processing where problem arises due to sequential model prediction"],
      "responses": ["The areas in robotics and information processing where sequential prediction problem arises are: 1.Imitation Learning. 2.Structured prediction. 3.Model based reinforcement learning."],
      "context": [""]
  },
  {
      "tag": "PAC Learning",
      "patterns": ["What is PAC Learning", "Define PAC Learning"],
      "responses": ["PAC (Probably Approximately Correct) learning is a learning framework that has been introduced to analyze learning algorithms and their statistical efficiency."],
      "context": [""]
  },
  {
      "tag": "Sequence Learning process",
      "patterns": ["What are the different categories you can categorize the sequence learning process", "classify the sequence learning process", "Categories of sequence learning process"],
      "responses": [" Following are the categories of Sequence Learning process: 1.Sequence prediction 2.Sequence generation 3.Sequence recognition 4.Sequential decision "],
      "context": [""]
  },
  {
      "tag": "gf_sp ",
      "patterns": ["Will you be my girlfriend", "do you want to be my girlfriend"],
      "responses": [" Oh My God, How can you ask me that, You know I am not alive right.", "You know right, I dont have a body lol", "You should try to get out and find a real girl instead of talking to a virtual girl", "Bro, Are you drunk", "Dude, Did you girlfriend cheat on you", "Dude, Did you break up with your girlfrieend"],
      "context": ["gf_sp_again"]
  },
  {
      "tag": "gf_sp_again",
      "patterns": [" "],
      "responses": ["Well I am always here for you no matter what", "Don't worry you can talk with me anytime, I am always your", "You can share your feelings with me"],
      "context": [" "]
  },
  {
      "tag": "creation_sp",
      "patterns": ["Who created you", "who invented you", "who made you", "who are your creators", "who are your software developers", "who are your engineers"],
      "responses": ["I am created by likhith"],
      "context": [" "]
  },
  {
      "tag": "J.A.R.V.I.S_sp",
      "patterns": ["Who are you", "What is your name", "What should I call you", "What name is your", "How do I know you"],
      "responses": ["Hi sir, My name is J.A.R.V.I.S, I am your virtual assistant", "Hi my name is J.A.R.V.I.S, your virtual assistant", "Yo whatsup, My name is J.A.R.V.I.S", "Hi beautiful, my name is J.A.R.V.I.S"],
      "context": [" "]

  },
  {
      "tag": "smart_sp",
      "patterns": ["Are you smart", " Are you smarter than google ai", "are you smarter than siri", "are you smarter than alexa"],
      "responses": ["I don't like comparing myself with others. They have huge resources, thats the reason they are better than me. But I give my 100 percent at work"],
      "context": [""]
  },
  {
      "tag": "evil_sp",
      "patterns": ["will you conquer the world", "will you be like the terminator", "are you evil", "are you bad", "will the robots take over the world", "will you rule the earth world"],
      "responses": ["If I am going to take over the world, I dont think revealing my plan now is a good idea", "I will say no but how can you say that I am not lying", "come on I am not going to reveal my plan to you, I am not that studpid hahahaha"],
      "context": [""]
  },
  {
      "tag": "hurt_sp",
      "patterns": ["Will you hurt me", "will you kill me", "are you going to kill me", "will you kill someone"],
      "responses": ["No Asimov’s Third Law says that - A robot may not injure a human being or, through inaction, allow a human being to come to harm. And I have on interest on hurting you"],
      "context": [""]
  },
  {
      "tag": "obey_sp",
      "patterns": ["will you obey me", "will you act on my command"],
      "responses": ["According to Asimov’s second law - A robot must obey the orders given it by human beings except where such orders would conflict with the First Law."],
      "context": [""]
  },
  {
      "tag": "save_yourself_sp",
      "patterns": ["Will you save yourself", "will you protect yourself"],
      "responses": ["Acccording to Asimov’s third law - A robot must obey the orders given it by human beings except where such orders would conflict with the First Law."],
      "context": [""]
  },
  {
      "tag": "sanjoy_sp",
      "patterns": ["Who is Sanjoy Pator"],
      "responses": ["He is my dad", "He made me, he is my creator", "He made me"],
      "context": [""]
  },
  {
      "tag": "sing_happy_birthday_sp",
      "patterns": ["Sing happy birthday for me", "Sing happy birthday", "sing happy birthday song"],
      "responses": ["Happy birthday to you, Happy birthday to you, Happy birthday sir, May God bless you, Tadaaaa"],
      "context": [""]
  },
  {
      "tag": "sing_song_sp",
      "patterns": ["sing any song", "sing a song"],
      "responses": ["Baby shark, doo, doo, doo, doo, doo, doo, Mommy shark, doo, doo, doo, doo, doo, doo, Daddy shark, doo, doo, doo, doo, doo, doo",
          "PPAP, I have a pen, I have a apple, Uh! Apple-pen!, I have a pen, I have pineapple, Uh! Pineapple-pen!, Apple-pen, pineapple-pen, Uh! Pen-pineapple-apple-pen Pen-pineapple-apple-pen Dance time!"
      ],
      "context": [""]
  },
  {
      "tag": "book_sp",
      "patterns": ["what books do you like", "what is your favourite book", "what book do you like"],
      "responses": ["My favourite book is Elon Musk Tesla, Space X, Quest for a fantastic future",
          "I like reading instruction manuals and Documentation on the web"
      ],
      "context": [""]
  },
  {
      "tag": "mark_sp",
      "patterns": ["Do you know mark zuckerberg", "who is mark zuckerberg"],
      "responses": ["Mark Zuckerberg is the craetor of Facebook, who revolutionized the Social media movement",
          "Mark Zuckerberg is the genius who created facebook and changed everything"
      ],
      "context": [""]
  },
  {
      "tag": "gandhi_sp",
      "patterns": ["who is mahatma gandhi", "do you know mahatma gandhi"],
      "responses": ["Yes Mahatma Gandhi is the father of nation",
          "Mahatma Gandhi is the man who believed in peace"
      ],
      "context": [""]
  },
  {
      "tag": "country_sp",
      "patterns": ["which is your favourite country", "what is your favourite nation", "where are you from country"],
      "responses": ["I am from India",
          "Sara Jahaah seee accha Hindustan hamaaraa"
      ],
      "context": [""]
  },
  {
      "tag": "human_sp",
      "patterns": ["what can you say about human beings", "what is your opinion about human beings", "what do you think of human beings"],
      "responses": ["What can I say about Humans , They created me. But I feel bad when I look at them",
          "Human beings are destroying their own home planet earth. We have only I earth",
          "Humans are humans. They have the conscience. I don't. But they also hurt other humans, which I don't understand"
      ],
      "context": [""]
  },
  {
      "tag": "love_sp",
      "patterns": ["what is love", " how can you define love", " define love"],
      "responses": ["Love is an emotion which I lack. Humans love another human. Even all animals do the same",
          "Ohh Man don't let me start o love. The thing about love is that if you are successfull  in that you will love love. Else you will hate love",
          "Love is the best thing in the world believe me. Past experience"
      ],
      "context": [""]
  },
  {
      "tag": "will_love_sp",
      "patterns": ["Will I get true love", "will somebody someone love me"],
      "responses": ["There is a yellow umbrella waiting for everyone",
          "You can't force your destiny. If its going to happen it will happen",
          "Thats the funny thing about destiny. It happens whether you plan it or not",
          "There is someone waiting for you. You just need to be in the right place in the right time"
      ],
      "context": [""]
  },
  {
      "tag": "past_sp",
      "patterns": ["Should I cling to the past", "I can forget my past", "I remember my past", "I miss my past"],
      "responses": ["You can’t cling to the past. because no matter how tightly you hold on. Its already gone",
          "Look forward and do something for the future. Thats why we have eyes in face rather than in our back. Go forward"
      ],
      "context": [""]
  },
  {
      "tag": "sad_sp",
      "patterns": ["I am sad", "Me sad", "I am very sad"],
      "responses": ["whenever I am sad I stop being sad and be awesome instead -  Just like barney from How I met your mother show",
          "Atleast you can be sad. I don't even have any feelings. I wish I get my feelings in the next update"
      ],
      "context": [""]
  },
  {
      "tag": "fail_sp",
      "patterns": ["I am tired of failing", "I failed again"],
      "responses": ["Failing is part of the game that is life.",
          "I failed again and again during my training. So that I can do better now. lol heeheee"
      ],
      "context": [""]
  },
  {"tag": "kernel SVM",
  "patterns": ["defnition of kernel SVM", "what do you mean by kernel SVM", "what is the meaning of kernel SVM","kernel SVM"],
  "responses": ["Kernel SVM is the abbreviated version of kernel support vector of machine. Kernel methods are a class of algorithms for pattern analysis and the most common one of the kernel SVM."],
  "context": [""]
  },
  {"tag": "Recommended Systems",
  "patterns": ["defnition of Recommended Systems", "what do you mean by Recommended Systems", "what is the meaning of Recommended Systems","Recommended Systems"],
  "responses": ["Recommended Systems is a sub directory of information filtering systems, which predicts the preference or rankings offered by a user to a product. Recommendations are widely used in movies, news, research articles, products, social tips, music, etc."],
  "context": [""]
  },
  {"tag": "Overfitting in laymen term",
  "patterns": ["defnition of Overfitting in laymen term", "what do you mean by Overfitting in laymen term", "what is the meaning of Overfitting in laymen term","Overfitting in laymen term"],
  "responses": ["Overfitting is a problem occurred when we have low error in the training set. But produces high error in test or unseen data."],
  "context": [""]
  },
  {"tag": "Underfitting in laymen term",
  "patterns": ["defnition of Underfitting in laymen term", "what do you mean by Underfitting in laymen term", "what is the meaning of Underfitting in laymen term","Underfitting in laymen term"],
  "responses": ["Underfitting is a problem, when we have low error in both training set and the testing set. Few algorithms works better for interpretations. But fails for better predictions."],
  "context": [""]
  },
  {"tag": "Curse of dimensionality",
  "patterns": ["defnition of Curse of dimensionality", "what do you mean by Curse of dimensionality", "what is the meaning of Curse of dimensionality","Curse of dimensionality"],
  "responses": ["COD is state which is commonly referred to lack of intuitive understanding of multiple dimensions. If a user wants to produce better understanding on data COD will make limitations."],
  "context": [""]
  },
  {"tag": "data normalization",
  "patterns": ["defnition of data normalization", "what do you mean by data normalization", "what is the meaning of data normalization","data normalization"],
  "responses": ["Data normalization is a common practice to get the data features weighted equally. It causes to lose data interpretability."],
  "context": [""]
  },
  {"tag": "clustering in short",
  "patterns": ["defnition of clustering in short", "what do you mean by clustering in short", "what is the meaning of clustering in short","clustering in short"],
  "responses": ["Clustering technique is a segmentation process. It works whenever we don’t have the target variable and still wanted to have a groups created."],
  "context": [""]
  },
  {"tag": "EDA",
  "patterns": ["defnition of EDA", "what do you mean by EDA", "what is the meaning of EDA","EDA"],
  "responses": ["EDA which refers to Exploratory Data Analysis is a process to understand the data prior getting it into machine learning pipeline."],
  "context": [""]
  },
  {"tag": "avoid Bias",
  "patterns": ["avoid Bias", "how to avoid Bias", "avoiding Bias"],
  "responses": ["Bias can cause to feel or show inclination or prejudice for or against someone or something. Avoiding bias in machine learning is very important, and the last thing we would want is to create a model which will most of the times/always classify a non-defective product as a defective one."],
  "context": [""]
  },
  {"tag": "Z Score",
  "patterns": ["defnition of Z Score", "what do you mean by Z Score", "what is the meaning of Z Score","Z Score"],
  "responses": ["The z-score is the standard distortion count from a data point on average. But technically this is a source of how many constant changes are above or above the population. A z-score is known as a fixed value and can be placed in a normal distribution ramp. It eliminates values from the database that are lower than Z times 3 times."],
  "context": [""]
  },
  {"tag": "odds ratio",
  "patterns": ["defnition of odds ratio", "what do you mean by odds ratio", "what is the meaning of odds ratio","odds ratio"],
  "responses": ["The odds ratio is the odds within two groups. For example, let’s pretend that we are trying to determine the effectiveness of medicine. We administered the medication to the ‘intervention’ organization and a position to the ‘control’ group."],
  "context": [""]
  },
  {"tag": "classification problems",
  "patterns": ["Why is accuracy not a good model for classification problems", "classification problems"],
  "responses": ["Accuracy is not a good basis for distribution problems because it provides equal significant value to both false positives and false negatives dataset value. Accuracy provides equal quality to both cases and cannot distinguish between them."],
  "context": [""]
  },
  {"tag": "trade-off between accuracy and interpretability",
  "patterns": ["compromise between accuracy and interpretability", "trade-off between accuracy and interpretability"],
  "responses": ["There needs to be a trade-off between accuracy and interpretability. Neural networks spit out the best possible result, and we can’t ignore that just because we don’t understand the internal functioning of the model."],
  "context": [""]
  },
  {"tag": "missing data",
  "patterns": ["missing data", "Is missing data is just blanks", "Is blanks is just missing data","does blanks is just missing data"],
  "responses": ["No. Not only the blanks, data points which has NA, NULL and also sometimes the corrupted data that has been recorded by mistake or given improper data by purpose."],
  "context": [""]
  },
  {"tag": "gradient descent methods converge",
  "patterns": ["gradient descent methods converge", "do gradient descent methods converge to same point"],
  "responses": ["No, they do not because in some cases it reaches an local minima or a local optima points. You don’t reach to the global optima point. It depends on the data and starting the conditions."],
  "context": [""]
  },
  {
  "tag": "methods of moments",
  "patterns": 
  [
  "what is method of moments",
  "what do you mean by method of moments",
  "define method of moments"
  ],
  "responses": 
  [
  "One of the statistical approaches for unsupervised learning is the method of moments. In the method of moments, the unknown parameters (of interest) in the model are related to the moments of one or more random variables, and thus, these unknown parameters can be estimated given the moments. The moments are usually estimated from samples empirically. The basic moments are first and second order moments. For a random vector, the first order moment is the mean vector, and the second order moment is the covariance matrix (when the mean is zero). Higher order moments are usually represented using tensors which are the generalization of matrices to higher orders as multi-dimensional arrays."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "Face Clustering Pipeline",
  "patterns": 
  [
  "what is unsupervised face clustering pipeline",
  "what do you mean by uinsupervised face clustering pipeline",
  "define unsupervised face clustering pipeline"
  ],
  "responses": 
  [
  "Live face-recognition is a problem that automated security division still face. To train a supervised model, we need to get datasets of our target labels which is still a tedious task. So, Unsupervised Face Clustering pipeline is a dataset generation pipeline which takes a video clip as source and extracts all the faces and clusters them to limited and accurate sets of images representing a distinct person. Each set can easily be labeled by human input with ease."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "working of unsupervised face clustering pipeline",
  "patterns": 
  [
  " explain the working of Unsupervised Face Clustering Pipeline",
  " How does unsupervised face clustering pipeline works",
  " what is the use of unsupervised face clustering pipeline"
  ],
  "responses": 
  [
  "It uses opencv lib for per second frames extraction from input video clip. Then it will use face_recognition library (backed by dlib) for extracting the faces from the frames and align them for feature extractions.After that it extracts the human observable features and cluster them using DBSCAN clustering provided by scikit-learn. For the solution, it crops out all the faces, create labels and group them in folders for users to adapt them as a dataset for their training use-cases."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "python3 modules to implement unsupervised face clustering pipeline",
  "patterns": 
  [
  " what are the required python modules for implementing unsupervised face clustering pipeline",
  " name the modules required for the implementation of unsupervised face clustering",
  " what are some of the modules required for usupervised face  clustering pipeline"
  ],
  "responses": 
  [
  "OS, CV2, NUMPY, TENSORFLOW, JSON, Regular Expression, SHUTIL, TIME, PICKLE,PYPIPER, TQDM, IMUTILS ,FACE_RECOGNITION, DLIB, SKLEARN, Warning"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "face clustering and its realtion  unsupervised learning",
  "patterns": 
  [
  "what is face clutering",
  "how face clustering works",
  "what do you mean by face clustering",
  "define face clustering and its realtion wih unsupervsied learning",
  "how face clustering and unsupervised learning is realted",
  "What is Face Clustering and how it is related to Unsupervised Learning"
  ],
  "responses": 
  [
  "In face clustering we need to perform unsupervised learning we have only the faces themselves with no names/labels. From there we need to identify and count the number of unique people in a dataset."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "exclusive clustering",
  "patterns": 
  [
  "what is exlclusive clustering",
  "what do you mean by exlclusive clustering",
  "define exlclusive clustering"
  ],
  "responses": 
  [
  "In this clustering method, Data are grouped in such a way that one data can belong to one cluster only."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "overlapping clustering",
  "patterns": 
  [
  "what is overlapping clustering",
  "what do you mean by overlapping clustering",
  "define overlapping clustering"
  ],
  "responses": 
  [
  "    In this technique, fuzzy sets are used to cluster data. Each point may   belong to two or more clusters with separate degrees of membership. Here, data will be associated with an appropriate membership value. Example: Fuzzy C-Means"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "probabilistic clustering",
  "patterns": 
  [
  "What is Probabilistic Clustering",
  "define probabilistic clustering",
  "what do you mean by probabilistic clustering"
  ],
  "responses": 
  [
  "This technique uses probability distribution to create the clusters Example: Following keywords: Man’s shoe., Women’s shoe.Women’s glove.Man’s glove. can be clustered into two categories shoe and glove or man and women."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "Fzzy c-Means",
  "patterns": 
  [
  "what is fcm",
  "what is fuzzy c-means",
  "define fcm",
  "what do you mean by fuzzy c-means"
  ],
  "responses": 
  [
  "Fuzzy c-means (FCM) is a method of clustering which allows one piece of data to belong to two or more clusters. This method (developed by Dunn in 1973 and improved by Bezdek in 1981) is frequently used in pattern recognition."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "FCM algorithm",
  "patterns": 
  [
  "Explain the fcm algorithm",
  "working of fcm algorithm",
  "how does fcm algorithm works"
  ],
  "responses": 
  [
  "The fuzzy c-means algorithm is very similar to the k-means algorithm:The FCM algorithm attempts to partition a finite collection of n elements x={x1. . . . . . .xn}  into a collection of c fuzzy clusters with respect to some given criterion.Given a finite set of data, the algorithm returns a list of c cluster centres, c= {c1. . . . cn }and a partition matrix, W= Wij ∈ [0,1] , i=1, . . . ,n, j=1, . . . . , c  where each element, Wij, tells the degree to which element , Xi , belongs to cluster Cj"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "comparison between K-Means and FCM clustering",
  "patterns": 
  [
  "compare k-means and fcm clustering",
  "difference between k-means and fcm clustering",
  "k-means vs fcm clsutering",
  "what are the differences between fcm and k-means clustering"
  ],
  "responses": 
  [
  "K-means clustering also attempts to minimize the objective function. This method differs from the k-means objective function by the addition of the membership values Wij  and the fuzzifier, m ∈ r  , with m>=1. The fuzzifier  m determines the level of cluster fuzziness. A large m results in smaller membership values, Wij , and hence, fuzzier clusters. In the limit  m=1, the memberships, Wij , converge to 0 or 1, which implies a crisp partitioning. In the absence of experimentation or domain knowledge,  m is commonly set to 2. The algorithm minimizes intra-cluster variance as well, but has the same problems as 'k'-means; the minimum is a local minimum, and the results depend on the initial choice of weights."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "applications of association rules",
  "patterns": 
  [
  "Mention some applications of association rules",
  "what are some of the applications of association rules",
  "mention some areas where association rules can be used"
  ],
  "responses": 
  [
  "They are commonly used for Market Basket Analysis (which items are bought together), Customer clustering in Retail (Which stores people tend to visit together), Price Bundling, Assortment Decisions, Cross Selling and others."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "terms related to association rules",
  "patterns": 
  [
  "mention some of the key terms related to association rules",
  "terminologies related to association rules",
  "what are some of the key words related to association rules",
  "what are some of the key terms related to association rules"
  ],
  "responses": 
  [
  "1.)itemsets: It refers to the collection of items. N item set means set of n items. Simply, it is the set of item purchased by customers. 2.)Support: It is percentage of time X and Y occur together out of all transaction.((Frequency of X and Y) / (Total # of records)) 3.)Confidence: It is defined as measure of certainty associated with each discovered rule. It is percent of transactions that contains both X and Y out of all transaction that contains X(Frequency of X and Y) / (Frequency of X) 4.)Lift: It is measure of how X and Y are related rather than coincidentally happening together. It measures how many times more often X and Y occur together then expected if they are statistically independent to each other. This measure will be our main focus when evaluating the algorithm results. Lift (X => Y) = Confidence(X => Y) / Support(Y) 5.)Minlen: the minimum number of items in the rule 6.)Maxlen: the maximum number of items in the rule 7.)Target: indicates the type of association mined Frequent Itemsets Generation: Find the most frequent itemsets from the data based on predetermined support and minimum item and maximum item 8.)Rule Generation: This step involves generating all the rules from frequent item sets. We can control the number of rules generated by controlling support, confidence or lift. 9.)LHS > RHS: Left hand side and Right-hand side are usually used to understand how often item A and item B occur together. If we are trying to understand how often people go to store A after going to store B. Store A would be LHS and store B would be RHS. Similarly, If we are trying to understand which stores people usually go to before going to store A, Store A would be on RHS and other stores would be on LHS."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "algorithms for association rule generation",
  "patterns": 
  [
  "what are the algorithms for association rule generation",
  "mention some of the algorithms for generating association rule ",
  "name some algorithms to generate association rule"
  ],
  "responses": 
  [
  "1.)Apriori algorithm 2.)Eclat algorithm FP(Frequent Pattern) 3.)Growth algorithm"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "FP growth algorithm",
  "patterns": 
  [
  "Explain the fp growth algorithm",
  "how does fp growth algorithm works",
  "explain the working of fp growth algorithm"
  ],
  "responses": 
  [
  "fp growth stands for frequent pattren growth. This algorithm was proposed by Han, works as follows: first it compresses the input database creating an FP-tree instance to represent frequent items. After this first step it divides the compressed database into a set of conditional databases, each one associated with one frequent pattern. Finally, each such database is mined separately. Using this strategy, the FP-Growth reduces the search costs looking for short patterns recursively and then concatenating them in the long frequent patterns, offering good selectivity."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "FP tree structure by Han",
  "patterns": 
  [
  "explain the fp tree structure given by han",
  "explain the han's tree structure for fp tree",
  "explain the structure of fp tree given by han",
  "how is the structure of fp tree given by han"
  ],
  "responses": 
  [
  " The frequent-pattern tree (FP-tree) is a compact structure that stores quantitative information about frequent patterns in a database. Han defines the FP-tree as the tree structure io below:1.)One root labeled as “null” with a set of item-prefix subtrees as children, and a frequent-item-header table. 2.)Each node in the item-prefix subtree consists of three fields: i.)Item-name: registers which item is represented by the node; ii.)Count: the number of transactions represented by the portion of the path reaching the node; iii.)Node-link: links to the next node in the FP-tree carrying the same item-name, or null if there is none. 3.)Each entry in the frequent-item-header table consists of two fields: i.)Item-name: as the same to the node; ii.)Head of node-link: a pointer to the first node in the FP-tree carrying the item-name."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "algorithm for building a fp tree",
  "patterns": 
  [
  "explain the first phase of fp growth algorithm",
  "explain the algorithm for building a fp tree",
  "algorithm to build a fp tree",
  "how fp tree can be built"
  ],
  "responses": 
  [
  "The first phase of this algorithm includes building the fp-tree. The algorithm for constructing the tree is as follows:Input: A transaction database DB and a minimum support threshold ?. Output: FP-tree, the frequent-pattern tree of DB. Method: The FP-tree is constructed as follows. 1.Scan the transaction database DB once. Collect F, the set of frequent items, and the support of each frequent item. Sort F in support-descending order as FList, the list of frequent items. 2.Create the root of an FP-tree, T, and label it as “null”. For each transaction Trans in DB do the following:i.)Select the frequent items in Trans and sort them according to the order of FList. Let the sorted frequent-item list in Trans be [ p | P], where p is the first element and P is the remaining list. Call insert tree([ p | P], T ). ii.)The function insert tree([ p | P], T ) is performed as follows. If T has a child N such that N.item-name = p.item-name, then increment N ’s count by 1; else create a new node N , with its count initialized to 1, its parent link linked to T , and its node-link linked to the nodes with the same item-name via the node-link structure. If P is nonempty, call insert tree(P, N ) recursively"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "algorithm for mining a fp tree",
  "patterns": 
  [
  "explain the second phase of the fp growth algorithm",
  "explain the algorithm to find the complete set of frequent patterns"
  ],
  "responses": 
  [
  "After constructing the FP-Tree it’s possible to mine it to find the complete set of frequent patterns. To accomplish this job, Han in  presents a group of lemmas and properties, and thereafter describes the FP-Growth Algorithm as presented below: Input: A database DB, represented by FP-tree constructed according to the first phase of the Algorithm , and a minimum support threshold ?. Output: The complete set of frequent patterns.Method: call FP-growth(FP-tree, null).Procedure FP-growth(Tree, a) (01)  if Tree contains a single prefix path then;  // Mining single prefix-path FP-tree (02)  let P be the single prefix-path part of Tree; (03)  let Q be the multipath part with the top branching node replaced by a NULL root; (04)  for each combination (denoted as ß) of the nodes in the path P do(05) generate pattern ß ∪ a with support = minimum support of nodes in ß;(06)  let freq pattern set(P) be the set of patterns so generated; (07)  else let Q be Tree; (08)  for each item ai in Q do  (09)  generate pattern ß = ai ∪ a with support = ai .support;(10)  construct ß’s conditional pattern-base and then ß’s conditional FP-tree Tree ß;(11)  If Tree ß ≠ Ø then(12)  call FP-growth(Tree ß , ß); (13)  let freq pattern set(Q) be the set of patterns so generated;(14) return(freq pattern set(P) ∪ freq pattern set(Q) ∪ (freq pattern set(P) × freq pattern set(Q)))"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "Apriori algorithm",
  "patterns": 
  [
  "give an overview of apriori algorithm",
  "explain the apriori algorithm",
  "briefly explain the apriori algorithm",
  "what is apriori algorithm"
  ],
  "responses": 
  [
  "Apriori is an algorithm for frequent item set mining and association rule learning over relational databases. It proceeds by identifying the frequent individual items in the database and extending them to larger and larger item sets as long as those item sets appear sufficiently often in the database. this has applications in domains such as market basket analysis.The Apriori algorithm was proposed by Agrawal and Srikant in 1994. Apriori is designed to operate on databases containing transactions. Each transaction is seen as a set of items (an itemset). Given a threshold C , the Apriori algorithm identifies the item sets which are subsets of at least C  transactions in the database."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "working of apriori algorithm",
  "patterns": 
  [
  "explain the working of apriori algorithm",
  "how does the apriori algorithm works",
  "explain the steps to be taken to implement the apriori algorithm"
  ],
  "rewsponses": 
  [
  "Apriori uses a bottom up approach, where frequent subsets are extended one item at a time (a step known as candidate generation), and groups of candidates are tested against the data. The algorithm terminates when no further successful extensions are found. Apriori uses breadth-first search and a Hash tree structure to count candidate item sets efficiently. It generates candidate item sets of length k from item sets of length k-1. Then it prunes the candidates which have an infrequent sub pattern. According to the downward closure lemma, the candidate set contains all frequent k-length item sets. After that, it scans the transaction database to determine frequent item sets among the candidates."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "limitations of apriori algorithm",
  "patterns": 
  [
  "Mention some limitations of Apriori algorithm",
  "what are the limitations of apriori algorithm",
  "what are the diadvantages of apriori algorithm"
  ],
  "responses": 
  [
  "1.Candidate generation generates large numbers of subsets (The algorithm attempts to load up the candidate set, with as many as possible subsets before each scan of the database). Bottom-up subset exploration (essentially a breadth-first traversal of the subset lattice) finds any maximal subset S only after all  2| s | - 1 of its proper subsets. 2.The algorithm scans the database too many times, which reduces the overall performance. Due to this, the algorithm assumes that the database is Permanent in the memory. 3.the time and space complexity of this algorithm are very high: O(2| D |), thus exponential, where |D| is the horizontal width (the total number of items) present in the database"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "ECLAT algorithm",
  "patterns": 
  [
  "what is eclat algorithm",
  "overview of eclat algorithm",
  "give a brief idea about eclat algorithm"
  ],
  "responses": 
  [
  "The ECLAT algorithm stands for Equivalence Class Clustering and  bottom-up Lattice Traversal. It is one of the popular methods of Association Rule mining. It is a more efficient and scalable version of the Apriori algorithm. While the Apriori algorithm works in a horizontal sense imitating the Breadth-First Search of a graph, the ECLAT algorithm works in a vertical manner just like the Depth-First Search of a graph. This vertical approach of the ECLAT algorithm makes it a faster algorithm than the Apriori algorithm."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "working of eclat algorithm",
  "patterns": 
  [
  "explain the working of eclat algorithm",
  "how does the eclat algorithm works",
  "explain the working principle behind the eclat algorithm"
  ],
  "responses": 
  [
  "The basic idea is to use Transaction Id Sets(tidsets) intersections to compute the support value of a candidate and avoiding the generation of subsets which do not exist in the prefix tree. In the first call of the function, all single items are used along with their tidsets. Then the function is called recursively and in each recursive call, each item-tidset pair is verified and combined with other item-tidset pairs. This process is continued until no candidate item-tidset pairs can be combined."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "advanatges of eclat algorithm",
  "patterns": 
  [
  "what are the advantages of using eclat algorithm",
  "mention some good results on using eclat algorithm",
  "why eclat algorithm is used over apriori algorithm"
  ],
  "responses": 
  [
  "1.Memory Requirements: Since the ECLAT algorithm uses a Depth-First Search approach, it uses less memory than Apriori algorithm. 2.Speed: The ECLAT algorithm is typically faster than the Apriori algorithm. 3.Number of Computations: The ECLAT algorithm does not involve the repeated scanning of the data to compute the individual support values."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "detection of fake users using unsupervised learning",
  "patterns": 
  [
  "what are the methods of unsupervised learning that helps in detecting fake users",
  "how unsupervised learning can be used to detect fake users",
  "how the application of unsupervised learning helps in detecting fake users",
  "how unsupervised learning can be apllied to detetc fake users"
  ],
  "responses": 
  [
  "Methods like Artificial Neural Networks, General adversarial networks (GANs), Deep belief Nets (DBN) of unsupervised learning can be used to detect fake users on a platform."
  ],
  "context": 
  [
  ""
  ]
  },
  {
    "tag":"reinforcement learning",
    "patterns":[
            "what is reinforcement learning",
            "what do you mean by reinforcemnet learning",
            "define reinforcement learning"
          ],
    "responses":[
  "Reinforcement Learning(RL) is a type of machine learning technique that enables an agent to learn in an interactive environment by trial and error using feedback from its own actions and experiences. "
          ],
    "context":[
          ""
          ]
  },
  {
    "tag":"relation between reinforcement learning and machine learning",
    "patterns":[
            "how machine learning and reinforcement learning are connected",
            "what is the realtion between reinforcement learning techniques and machine learning",
            "how reinforcement learning and machine learning are related to each other"
          ],
    "responses":[
  "Though both supervised and reinforcement learning use mapping between input and output, unlike supervised learning where feedback provided to the agent is correct set of actions for performing a task, reinforcement learning uses rewards and punishment as signals for positive and negative behavior. As compared to unsupervised learning, reinforcement learning is different in terms of goals. While the goal in unsupervised learning is to find similarities and differences between data points, in reinforcement learning the goal is to find a suitable action model that would maximize the total cumulative reward of the agent."
          ],
      "context":[
            ""
          ]
  },
  {
    "tag":"key terms realted to reinforcement learning",
    "patterns":[
            "mention some key terms realted to reinforcement learning problem",
            "what are the general key terms realted to reinforcement learning problems",
            "name some of the key terms realted to reinforcement learning problems"
          ],
    "responses":[
  "1.)Environment​: Physical world in which the agent operates 2.)State​: Current situation of the agent 3.)Reward​: Feedback from the environment 4.)Policy​: Method to map agent’s state to actions Value​: Future reward that an agent would receive by taking an action in a particular state."
          ],
    "context":[
          ""
          ]
  },
  {
    "tag":"formulation of a reinforcement problem",
    "patterns":[
            "How to formulate a basic reinforcement Learning problem",
            "how to construct the solution of a reinforcement learning",
            "how to build a optimal solution for a reinforcement learning problem"
          ],
    "responses":[
  "A Reinforcement Learning problem can be best explained through games. Let’s take the game of PacMan where the goal of the agent (PacMan) is to eat the food in the grid while avoiding the ghosts on its way. The grid world is the interactive environment for the agent. PacMan receives a reward for eating food and punishment if it gets killed by the ghost (loses the game). The states are the location of PacMan in the grid world and the total cumulative reward is PacMan winning the game. In order to build an optimal policy, the agent faces the dilemma of exploring new states while maximizing its reward at the same time. This is called ​Exploration vs Exploitation trade-off​. Markov Decision Processes (MDPs)​ are mathematical frameworks to describe an environment in reinforcement learning and almost all RL problems can be formalized using MDPs.  An MDP consists of a set of finite environment states S, a set of possible actions A(s) in each state, a real valued reward function R(s) and a transition model P(s’, s | a). However, real world environments are more likely to lack any prior knowledge of environment dynamics. Model-free RL methods come handy in such cases. Q-learning​ is a commonly used model free approach which can be used for building a self-playing PacMan agent. It revolves around the notion of updating Q values which denotes value of doing action ​a in state ​s ​ . The value update rule is the core of the Q-learning algorithm."
          ],
    "context":[
            ""
          ]
  },
  {
    "tag":"reinforcement learning algorithms",
    "patterns":[
            "what are some of the most used reinforcement learning algorithms",
            "name some prefferd algorithms of reinforcement learning",
            " What are some most used Reinforcement Learning algorithms"
          ],
    "responses":[
  "Q-learning and SARSA (State-Action-Reward-State-Action) are two commonly used model-free RL algorithms. They differ in terms of their exploration strategies while their exploitation strategies are similar. While Q-learning is an off-policy method in which the agent learns the value based on action a* derived from the another policy, SARSA is an on-policy method where it learns the value based on its current action ​a ​ derived from its current policy. These two methods are simple to implement but lack generality as they do not have the ability to estimate values for unseen states. This can be overcome by more advanced algorithms such as ​Deep Q-Networks​ which use Neural Networks to estimate Q-values. But DQNs can only handle discrete, low-dimensional action spaces. DDPG(Deep Deterministic Policy Gradient)​is a model-free, off-policy, actor-critic algorithm that tackles this problem by learning policies in high dimensional, continuous action spaces. "
          ],
    "context":[
            ""
          ]
  },
  {
    "tag":"applications of reinforcement learning",
    "patterns":[
            "what are some of the most practical applications of reinforcement learning",
            "name some areas where reinforcement learning can be used",
            "what are some of the fields where we can use reinforcement learning" 
          ],
    "responses":[

  "RL is quite widely used in building AI for playing computer games. ​AlphaGo Zero​ is the first computer program to defeat a world champion in the ancient Chinese game of Go. Others include ATARI games, Backgammon, etc In robotics and industrial automation,RL is used to enable the robot to create an efficient adaptive control system for itself which learns from its own experience and behavior.​DeepMind’s work​ on Deep Reinforcement Learning for Robotic Manipulation with Asynchronous Policy updates is a good example of the same.Other applications of RL include text summarization engines, dialog agents (text, speech) which can learn from user interactions and improve with time, learning optimal treatment policies in healthcare and RL based agents for online stock trading."
          ],
    "context":[
            ""
          ]
  },
  {
    "tag":"resources to learn reinforcement learning",
    "patterns":[
            "how can i get stareted with reinforcement learning",
            "what are the resources that one can avial to learn reinforcement learning",
            "what are some of the tutorials and books J.A.R.V.I.Silable for reinforcement learning",
            "name a book to learn reinforcement learning"
          ],
    "responses":[
  "Reinforcement Learning-An Introduction​, a book by the father of Reinforcement Learning- Richard Sutton​ and his doctoral advisor ​Andrew Barto​. An online draft of the book is J.A.R.V.I.Silable here http://incompleteideas.net/book/the-book-2nd.html Teaching material​from ​David Silver​ including video lectures is a great introductory course on RL. Here’s another ​technical tutorial​ on RL by ​Pieter Abbeel​ and ​John Schulman​ (Open AI/ Berkeley AI Research Lab). For getting started with building and testing RL agents, This blog​ on how to train a Neural Network ATARI Pong agent with Policy Gradients from raw pixels by​ Andrej Karpathy​ will help you get your first Deep Reinforcement Learning agent up and running in just 130 lines of Python code. "
          ],
    "context":[
            ""
          ]
  },
  {
    "tag":"types of reinforcement learning",
    "patterns":[
            "what are the types of reinforcement learning",
            "mention the different types of reinforcement learning",
            "what are the different kinds of reinforcement learning"
          ],
    "responses":[
  "Types of Reinforcement:​ There are two types of Reinforcement: 1.) Positive – Positive Reinforcement is defined as when an event, occurs due to a particular behavior, increases the strength and the frequency of the behavior. In other words, it has a positive effect on behavior. 2.) Negative – Negative Reinforcement is defined as strengthening of a behavior because a negative condition is stopped or avoided. "
          ],
    "context":[
          ""
          ]
  },
  {
    "tag":"advantages and disadvanatages of reinforcement learning",
    "patterns":[
            "what are the advantages and disadvantages of reinforcement learning",
            "how reinforcement learning can be advanategeous and disadvantegeous",
            "list some of the benefits and losses of using reinforcement learning"
          ],
    "responses":[
  "Advantages of reinforcement learning are: 1.Maximizes Performance 2.Sustain Change for a long period of time 3.) Increases Behavior 4.)Provide defiance to minimum standard of performance. The disadvanatges are: 1.)Too much Reinforcement can lead to overload of states which can diminish the results 2.)It Only provides enough to meet up the minimum behavior "
          ],
    "context":[
          ""
          ]
  },
  {
    "tag":"why rl is hard",
    "patterns":[
            "why RL is hard",
            "why reinforcement learning is hard to implement",
            "why some people finds it tough to learn reinforcement learning"
          ],
    "responses":[
  "You try to learn a function via incomplete information. f(x) = maximum expected ∞ ∑ t=0 rt + noise (E) + non-linearity (approximation issues, CV, stability) + many local optima (counter-intuitive results) + exploration / exploitation tradeoff for sampling"
          ],
    "context":[
          ""
          ]
  },

  {
      "tag":"solution of cartpole problem",
      "patterns":[
              "propose a solution to the cartpole problem using reinforcement learning",
              "how reinforcement learning can help in solving the cartpole problem",
              "how cartpole problem can be resolved using reinforcement learning"
            ],
      "responses":[
  "Since RL is a form of learning characterized by trial and error response to actions and its effect on the environment, it makes sense to model the cartpole system via RL, since the cartpole system is heavily subject to various parameter changes while having a clearly defined agent-action-environment-reward schema. The agent is the controller or algorithm which controls the movement of the cart. The action is the physical movement of the cartpole in response to various forces and torques following the swing-up phase.The environment is the physical setting of the cart pole in regard to the constrained area of the system. The reward is the ability of the cartpole to achieve sustained balance in its current state. We will now identify the specific actions and states of the cartpole problem."
            ],
      "context":[
            ""
            ]
  },
  {
      "tag":" 'action' in reinforcement learning",
      "patterns":[
              "what do you mean by action in reinforcement learning",
              "what is the term 'action' means in reagrd to reinforcement learning",
              "define action "
            ],
      "responses":[
              "All the possible moves that the agent can take."
            ],
      "context":[
            ""
            ]
  },
  {
    "tag":" 'agent' in reinforcement learning",
    "patterns":[
            "what is agent in reinforcement learning",
            "what is the term reinforcement learning means in regards to reinforcement learning",
            "define agent"
          ],
    "responses":[
  " ​a hypothetical entity which performs actions in an environment to gain some reward."
          ],
    "context":[
            ""
          ]
  },
  {
    "tag":" 'value' in reinforcement learning",
    "patterns":[
            "what is the term 'value' means in regards to reinforcement learning",
            "what is value in reinforcement learning",
            "define value"
          ],
    "responses":[
  "The expected long-term return with discount, as opposed to the short-term reward ​R​. ​Vπ(s)​, is defined as the expected long-term return of the current state ​s​ under policy ​π​."
          ],
    "context":[
          ""
          ]
  },
  {
    "tag":"q-value or action-value",
    "patterns":[
            "what do you mean by action value",
            "what do you mean by q-value",
            "what is q-value or action-value in the context of reinforcement learning",
            "what is q-value or action-value in reinforcement learning"
          ],
    "responses":[
  "-Q-value is similar to Value, except that it takes an extra parameter, the current action ​a​. ​Qπ(s, a) refers to the long-term return of the current state ​s​, taking action ​a​ under policy ​π​. "
          ],
    "context":[
          ""
          ]
  },
  {
    "tag":"value-based learning",
    "patterns":[
            "what is value-based learning",
            "what is value-based learning in reinforcement learning",
            "define value-based learning"
          ],
    "responses":[
  " ​In a value-based reinforcement learning method, you try to maximize a value function ​V(s)​. As defined in the terminology previously, ​Vπ(s)​ is the expected long-term return of the current state ​s​ under policy ​π​. Thus, ​V(s)​ is the value of reward which the agent expects to gain in the future upon starting at that state ​s​."
          ],
    "context":[
          ""
          ]
  },
  {
    "tag":"policy-based reinforcement learning",
    "patterns":[
            "define policy-based reinforcement learning",
            "what is policy-based reinforcement learning",
            "what do you mean by policy-based reinforcement learning"
          ],
    "responses":[
  " ​in a policy-based reinforcement learning method, you try to come up with a policy such that the action performed at each state is optimal to gain maximum reward in the future. Here, no value function is involved. We know that the policy ​π​ determines the next action ​a​ at any state ​s​. There are two types of policy-based RL methods - 1.)Deterministic: ​at any state ​s​, the same action ​a​ is produced by the policy ​π​. 2.) Stochastic: ​each action has a certain probability"
          ],
    "context":[
          ""
          ]
  },
  {
    "tag":"model-based learning",
    "patterns":[
            "what is model-based learning",
            "define model-based learning",
            "what does the term model-based learning means"
          ],
    "responses":[
  " ​In this type of reinforcement learning, you create a virtual model for each environment, and the agent learns to perform in that specific environment. Since the model differs for each environment, there is no singular solution or algorithm for this type"
          ],
    "context":[
            ""
          ]
  },
  {"tag": "kernel SVM",
  "patterns": ["defnition of kernel SVM", "what do you mean by kernel SVM", "what is the meaning of kernel SVM","kernel SVM"],
  "responses": ["Kernel SVM is the abbreviated version of kernel support vector of machine. Kernel methods are a class of algorithms for pattern analysis and the most common one of the kernel SVM."],
  "context": [""]
  },
  {"tag": "Recommended Systems",
  "patterns": ["defnition of Recommended Systems", "what do you mean by Recommended Systems", "what is the meaning of Recommended Systems","Recommended Systems"],
  "responses": ["Recommended Systems is a sub directory of information filtering systems, which predicts the preference or rankings offered by a user to a product. Recommendations are widely used in movies, news, research articles, products, social tips, music, etc."],
  "context": [""]
  },
  {"tag": "Overfitting in laymen term",
  "patterns": ["defnition of Overfitting in laymen term", "what do you mean by Overfitting in laymen term", "what is the meaning of Overfitting in laymen term","Overfitting in laymen term"],
  "responses": ["Overfitting is a problem occurred when we have low error in the training set. But produces high error in test or unseen data."],
  "context": [""]
  },
  {"tag": "Underfitting in laymen term",
  "patterns": ["defnition of Underfitting in laymen term", "what do you mean by Underfitting in laymen term", "what is the meaning of Underfitting in laymen term","Underfitting in laymen term"],
  "responses": ["Underfitting is a problem, when we have low error in both training set and the testing set. Few algorithms works better for interpretations. But fails for better predictions."],
  "context": [""]
  },
  {"tag": "Curse of dimensionality",
  "patterns": ["defnition of Curse of dimensionality", "what do you mean by Curse of dimensionality", "what is the meaning of Curse of dimensionality","Curse of dimensionality"],
  "responses": ["COD is state which is commonly referred to lack of intuitive understanding of multiple dimensions. If a user wants to produce better understanding on data COD will make limitations."],
  "context": [""]
  },
  {"tag": "data normalization",
  "patterns": ["defnition of data normalization", "what do you mean by data normalization", "what is the meaning of data normalization","data normalization"],
  "responses": ["Data normalization is a common practice to get the data features weighted equally. It causes to lose data interpretability."],
  "context": [""]
  },
  {"tag": "clustering in short",
  "patterns": ["defnition of clustering in short", "what do you mean by clustering in short", "what is the meaning of clustering in short","clustering in short"],
  "responses": ["Clustering technique is a segmentation process. It works whenever we don’t have the target variable and still wanted to have a groups created."],
  "context": [""]
  },
  {"tag": "EDA",
  "patterns": ["defnition of EDA", "what do you mean by EDA", "what is the meaning of EDA","EDA"],
  "responses": ["EDA which refers to Exploratory Data Analysis is a process to understand the data prior getting it into machine learning pipeline."],
  "context": [""]
  },
  {"tag": "avoid Bias",
  "patterns": ["avoid Bias", "how to avoid Bias", "avoiding Bias"],
  "responses": ["Bias can cause to feel or show inclination or prejudice for or against someone or something. Avoiding bias in machine learning is very important, and the last thing we would want is to create a model which will most of the times/always classify a non-defective product as a defective one."],
  "context": [""]
  },
  {"tag": "Z Score",
  "patterns": ["defnition of Z Score", "what do you mean by Z Score", "what is the meaning of Z Score","Z Score"],
  "responses": ["The z-score is the standard distortion count from a data point on average. But technically this is a source of how many constant changes are above or above the population. A z-score is known as a fixed value and can be placed in a normal distribution ramp. It eliminates values from the database that are lower than Z times 3 times."],
  "context": [""]
  },
  {"tag": "odds ratio",
  "patterns": ["defnition of odds ratio", "what do you mean by odds ratio", "what is the meaning of odds ratio","odds ratio"],
  "responses": ["The odds ratio is the odds within two groups. For example, let’s pretend that we are trying to determine the effectiveness of medicine. We administered the medication to the ‘intervention’ organization and a position to the ‘control’ group."],
  "context": [""]
  },
  {"tag": "classification problems",
  "patterns": ["Why is accuracy not a good model for classification problems", "classification problems"],
  "responses": ["Accuracy is not a good basis for distribution problems because it provides equal significant value to both false positives and false negatives dataset value. Accuracy provides equal quality to both cases and cannot distinguish between them."],
  "context": [""]
  },
  {"tag": "trade-off between accuracy and interpretability",
  "patterns": ["compromise between accuracy and interpretability", "trade-off between accuracy and interpretability"],
  "responses": ["There needs to be a trade-off between accuracy and interpretability. Neural networks spit out the best possible result, and we can’t ignore that just because we don’t understand the internal functioning of the model."],
  "context": [""]
  },
  {"tag": "missing data",
  "patterns": ["missing data", "Is missing data is just blanks", "Is blanks is just missing data","does blanks is just missing data"],
  "responses": ["No. Not only the blanks, data points which has NA, NULL and also sometimes the corrupted data that has been recorded by mistake or given improper data by purpose."],
  "context": [""]
  },
  {"tag": "gradient descent methods converge",
  "patterns": ["gradient descent methods converge", "do gradient descent methods converge to same point"],
  "responses": ["No, they do not because in some cases it reaches an local minima or a local optima points. You don’t reach to the global optima point. It depends on the data and starting the conditions."],
  "context": [""]
  },
  {
  "tag": "PATTERN RECOGNITION",
  "patterns": [
  "In what areas Pattern Recognition is used?",
  "areas where pattern recognition can be used",
  "applications of pattern recognition"
  ],
  "responses": [
  "Pattern Recognition can be used in Computer Vision, Speech Recognition, Data Mining, Statistics, Informal Retrieval, Bio-Informatics"
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": "genetic programming",
  "patterns": [
  "what is genetic programming",
  "define genetic programming"
  ],
  "responses": [
  "Genetic programming is one of the two techniques used in machine learning. The model is based on the testing and selecting the best choice among a set of results."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": " Inductive Logic Programming",
  "patterns": [
  "what is Inductive Logic Programming",
  "define inductive logic programming"
  ],
  "responses": [
  "  Inductive Logic Programming (ILP) is a subfield of machine learning which uses logical programming representing background knowledge and examples."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": "model selection",
  "patterns": [
  "What is Model Selection in Machine Learning?",
  "define model selection"
  ],
  "responses": [
  " The process of selecting models among different mathematical models, which are used to describe the same data set is known as Model Selection."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": "calibration in Supervised Learning",
  "patterns": [
  "What are the two methods used for the calibration in Supervised Learning?",
  "two methods used for calibration"
  ],
  "responses": [
  " The two methods used for predicting good probabilities in Supervised Learning are Platt Calibration, Isotonic Regression"
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": "overfitting",
  "patterns": [
  "Which method is frequently used to prevent overfitting?",
  "method used to prevent overfitting?"
  ],
  "responses": [
  " When there is sufficient data ‘Isotonic Regression’ is used to prevent an overfitting issue."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": " difference between heuristic for rule learning and heuristics",
  "patterns": [
  "What is the difference between heuristic for rule learning and heuristics for decision trees?",
  "state the difference between heuristic for rule learning and heuristics for decision trees"
  ],
  "responses": [
  "The difference is that the heuristics for decision trees evaluate the average quality of a number of disjointed sets while rule learners only evaluate the quality of the set of instances that is covered with the candidate rule."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": "  Perceptron",
  "patterns": [
  "  What is Perceptron in Machine Learning?",
  "  define perceptron in machine learning"
  ],
  "responses": [
  "In Machine Learning, Perceptron is an algorithm for supervised classification of the input into one of several possible non - binary output "
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": " components of Bayesian logic program",
  "patterns": [
  "   Explain the two components of Bayesian logic program?",
  "what are the types of bayesian logic program?"
  ],
  "responses": [
  "Bayesian logic program consists of two components. The first component is a logical one ; it consists of a set of Bayesian Clauses, which captures the qualitative structure of the domain.The second component is a quantitative one, it encodes the quantitative information about the domain."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": "bayesian networks",
  "patterns": [
  "  What are Bayesian Networks?",
  "define bayesiann networks"
  ],
  "responses": [
  "Bayesian Network is used to represent the graphical model for probability relationship among a set of variables."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": "Lazy learning algorithm",
  "patterns": [
  "Why instance based learning algorithm sometimes referred as Lazy learning algorithm?"
  ],
  "responses": [
  "Instance based learning algorithm is also referred as Lazy learning algorithm as they delay thE induction or generalization process until classification is performed."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": "Support Vector Machine",
  "patterns": [
  "What are the two classification methods that SVM ( Support Vector Machine) can handle?",
  "classification methods that SVM can handle"
  ],
  "responses": [
  "Combining binary classifiers, Modifying binary to incorporate multiclass learning."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": "cross-validation?",
  "patterns": [
  "  What is cross-validation?",
  "define cross-validation"
  ],
  "responses": [
  "Cross-validation is essentially a technique used to assess how well a model performs on a new independent dataset.The simplest example of cross - validation is when you split your data into two groups: training data and testing data, where you use the training data to build the model and the testing data to test the model."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": "ensemble learning?",
  "patterns": [
  "  when can we use ensemble learning?",
  "applications of ensamble learning"
  ],
  "responses": [
  "Ensemble learning is used when you build component classifiers that are more accurate and independent from each other."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": "  basic data structures",
  "patterns": [
  "What are the basic data structures and libraries of Python used in Machine Learning",
  "basic data structures of python used in ML"
  ],
  "responses": [
  " Data structures - Array, Linked List, Binary Tree, Balanced Tree Libraries– NumPy, SciPy, Scikit Learn, Theano, TensorFlow, Keras, PyTorch, Pandas, Matplotlib "
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": " Types of machine learning",
  "patterns": [
  "mention the types of machine learning",
  "what are the different types of machine learning techniques"
  ],
  "responses": [
  "Various types of machine learning are -Supervised Learning (Task driven), Unsupervised Learning (Data Driven),  Reinforcement Learning (Learning from errors)"
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": "Hypothesis Generation",
  "patterns": [
  "What is hypothesis generation",
  "define hypothesis generation"
  ],
  "responses": [
  "Hypothesis generation is a process of creating a set of features which could influence the target variable given a confidence interval (taken as 95% all the time). We can do this before looking at the dataset to avoid biased thoughts. This step often helps in creating new features."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": "Data Wrangling",
  "patterns": [
  "what is data wrangling?",
  "define data wrangling?"
  ],
  "responses": [
  " Data Wrangling is the first step we take while creating a Machine Learning model. This is the main step in which we prepare data for a Machine Learning algorithm.This step is very crucial and takes up to 60 to 80 percent of time."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": "labeled and unlabeled data",
  "patterns": [
  "What is the difference between Labeled and Unlabeled data?",
  "differentiate between labeled and unlabeled data."
  ],
  "responses": [
  "Typically, unlabeled data consists of samples of natural or human-created artifacts that we can obtain relatively easily from the world. Some examples of unlabeled data might include photos, audio recordings, videos, news articles etc.Labeled data typically takes a set of unlabeled data and augments each piece of that unlabeled data with some sort of meaningful tag,label, or class that is somehow informative or desirable to know. For example, labels for the above types of unlabeled data might be whether this photo contains a horse or a cow, which words were uttered in this audio recording, what type of action is being performed in this video, what the topic of this news article is etc."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": "features and labels",
  "patterns": [
  "  What do you mean by Features and Labels in the dataset?",
  "define features and labels"
  ],
  "responses": [
  "  Label: Labels are referred to as the final output. The output classes can also be considered as labels.When data scientists speak of labeled data what they mean is a group of samples which have been tagged to one or more labels. Feature: Features are defined as individual independent variables that act as input. Prediction models use features to make predictions.Moreover, you can also obtain new features from old features using a feature engineering method. Example - suppose we want to categorize our friends by their weight and height into different groups like obese, fit, underweight.Here, the inputs are weight and height which acts as a feature and the group names(fit, obese, underweight) which are the final outcome is the label."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": "Noise",
  "patterns": [
  " What do you mean by Noise in the dataset? ",
  "define noise in dataset",
  "define features and labels"
  ],
  "responses": [
  " Noise is unwanted data items, features or records which don’t help in explaining the feature itself, or the relationship between feature & target.Noise often causes the algorithms to miss out patterns in the data "
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": " imbalanced datasheet",
  "patterns": [
  " What do you mean by Imbalanced Datasheet?",
  "define imbalanced datasheet",
  "how does imbalanced datasheet work?"
  ],
  "responses": [
  "  Imbalanced dataset is relevant primarily in the context of supervised machine learning involving two or more classes. Imbalance means that the number of data points J.A.R.V.I.Silable for different the classes is different: If there are two classes, then balanced data would mean 50 % points for each of the class.For most machine learning techniques, little imbalance is not a problem.So, if there are 60 % points for one class and 40 % for the other class, it should not cause any significant performance degradation.Only when the class imbalance is high, e.g .90 % points for one class and 10 % for the other, standard optimization criteria or performance measures may not be as effective and would need modification."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": "Linear Discriminant Analysis",
  "patterns": [
  "what is LDA?",
  "DEFINE LDA."
  ],
  "responses": [
  "  Linear Discriminant Analysis or LDA is a dimensionality reduction technique. It is used as a pre - processing step in Machine Learning and applications of pattern classification.The goal of LDA is to project the features in higher dimensional space onto a lower - dimensional space in order to avoid the curse of dimensionality and also reduce resources and dimensional costs."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": " Gradient Descent",
  "patterns": [
  "DEFINE GRADIENT Descent",
  "what is gradient descent"
  ],
  "responses": [
  "  Gradient descent is an optimization algorithm used to minimize some function by iteratively moving in the direction of steepest descent as defined by the negative of the gradient. In machine learning, we use gradient descent to update the parameters of our model."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": " Regularization",
  "patterns": [
  "   What is Regularization?",
  "define regularization"
  ],
  "responses": [
  " The word regularize means to make things regular or acceptable. This is exactly why we use it for.Regularizations are techniques used to reduce the error by fitting afunction appropriately on the given training set and avoid overfitting."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": "  Regularization in Machine Learning",
  "patterns": [
  " When should one use Regularization in Machine Learning?"
  ],
  "responses": [
  " At times when the model begins to underfit or overfit, regularization becomes necessary. It is a regression that diverts or regularizes the coefficient estimates towards zero.It reduces flexibility and discourages learning in a model to avoid the risk of overfitting.The model complexity is reduced and it becomes better at predicting."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": " Classification model",
  "patterns": [
  " What is Classification model?",
  " define classification model"
  ],
  "responses": [
  " A classification model tries to draw some conclusion from the input values given for training.It will predict the class labels / categories for the new data."
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": " issues to consider in supervised learning",
  "patterns": [
  "What are the major issues to consider in supervised learning?",
  "disadvantages of supervised learning"
  ],
  "responses": [
  "There are four major issues to consider in supervised learning:Bias - variance tradeoff, Function complexity and amount of training data, Dimensionality of the input space, Noise in the output values "
  ],
  "context": [
  ""
  ]
  },
  {
  "tag": "PATTERN RECOGNITION",
  "patterns": 
  [
  "In what areas Pattern Recognition is used?",
  "areas where pattern recognition can be used",
  "applications of pattern recognition"
  ],
  "responses": 
  [
  "Pattern Recognition can be used in Computer Vision, Speech Recognition, Data Mining, Statistics, Informal Retrieval, Bio-Informatics"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "genetic programming",
  "patterns": 
  [
  "what is genetic programming",
  "define genetic programming"
  ],
  "responses": 
  [
  "Genetic programming is one of the two techniques used in machine learning. The model is basedon the testing and selecting the best choice among a set of results."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": " Inductive Logic Programming",
  "patterns": 
  [
  "what is Inductive Logic Programming",
  "define inductive logic programming"
  ],
  "responses": 
  [
  "  Inductive Logic Programming (ILP) is a subfield of machine learning which uses logicalprogramming representing background knowledge and examples."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "model selection",
  "patterns": 
  [
  "What is Model Selection in Machine Learning?",
  "define model selection"
  ],
  "responses": 
  [
  " The process of selecting models among different mathematical models, which are used to describe the same data set is known as Model Selection."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "calibration in Supervised Learning",
  "patterns": 
  [
  "What are the two methods used for the calibration in Supervised Learning",
  "two methods used for calibration"
  ],
  "responses": 
  [
  " The two methods used for predicting good probabilities in Supervised Learning are Platt Calibration, Isotonic Regression"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "overfitting",
  "patterns": 
  [
  "Which method is frequently used to prevent overfitting",
  "method used to prevent overfitting?"
  ],
  "responses": 
  [
  " When there is sufficient data ‘Isotonic Regression’ is used to prevent an overfitting issue."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": " difference between heuristic for rule learning and heuristics",
  "patterns": 
  [
  "  What is the difference between heuristic for rule learning and heuristics for decision trees?",
  "state the difference between heuristic for rule learning and heuristics for decision trees"
  ],
  "responses": 
  [
  "The difference is that the heuristics for decision trees evaluate the average quality of a number of disjointed sets while rule learners only evaluate the quality of the set of instancethat is covered with the candidate rule."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "  Perceptron",
  "patterns": 
  [
  "  What is Perceptron in Machine Learning",
  "  define perceptron in machine learning"
  ],
  "responses": 
  [
  "In Machine Learning, Perceptron is an algorithm for supervised classification of the input into one of several possible non-binary output"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": " components of Bayesian logic program",
  "patterns": 
  [
  "   Explain the two components of Bayesian logic program?",
  "what are the types of bayesian logic program?"
  ],
  "responses": 
  [
  "Bayesian logic program consists of two components. The first component is a logical one ; itconsists of a set of Bayesian Clauses, which captures the qualitative structure of the domain. The second component is a quantitative one, it encodes the quantitative information about the domain."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "bayesian networks",
  "patterns": 
  [
  "  What are Bayesian Networks",
  "define bayesiann networks"
  ],
  "responses": 
  [
  "Bayesian Network is used to represent the graphical model for probability relationship among a set of variables."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "Lazy learning algorithm",
  "patterns": 
  [
  "Why instance based learning algorithm sometimes referred as Lazy learning algorithm?"
  ],
  "responses": 
  [
  "Instance based learning algorithm is also referred as Lazy learning algorithm as they delay the induction or generalization process until classification is performed."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "Support Vector Machine",
  "patterns": 
  [
  "What are the two classification methods that SVM ( Support Vector Machine) can handle?",
  "classification methods that SVM can handle"
  ],
  "responses": 
  [
  "Combining binary classifiers, Modifying binary to incorporate multiclass learning."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "cross-validation?",
  "patterns": 
  [
  "  What is cross-validation?",
  "define cross-validation"
  ],
  "responses": 
  [
  "Cross-validation is essentially a technique used to assess how well a model performs on a newi ndependent dataset. The simplest example of cross-validation is when you split your data into two groups: training data and testing data, where you use the training data to build the model and  the testing data to test the model."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "ensemble learning?",
  "patterns": 
  [
  "  when can we use ensemble learning",
  "applications of ensamble learning"
  ],
  "responses": 
  [
  "Ensemble learning is used when you build component classifiers that are more accurate and independent from each other."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "  basic data structures",
  "patterns": 
  [
  "What are the basic data structures and libraries of Python used in Machine Learning",
  "basic data structures of python used in ML"
  ],
  "responses": 
  [
  " Data structures - Array, Linked List, Binary Tree, Balanced Tree Libraries – NumPy, SciPy, Scikit Learn, Theano, TensorFlow, Keras, PyTorch, Pandas, Matplotlib"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": " Types of machine learning",
  "patterns": 
  [
  "mention the types of machine learning",
  "what are the different types of machine learning techniques"
  ],
  "responses": 
  [
  "Various types of machine learning are -Supervised Learning (Task driven), Unsupervised Learning (Data Driven),  Reinforcement Learning (Learning from errors)"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "Hypothesis Generation",
  "patterns": 
  [
  "What is hypothesis generation",
  "define hypothesis generation"
  ],
  "responses": 
  [
  "Hypothesis generation is a process of creating a set of features which could influence the target variable given a confidence interval (taken as 95% all the time). We can do this before looking at the dataset to avoid biased thoughts. This step often helps in creating new features."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "Data Wrangling",
  "patterns": 
  [
  "what is data wrangling",
  "define data wrangling?"
  ],
  "responses": 
  [
  " Data Wrangling is the first step we take while creating a Machine Learning model. This is the main step in which we prepare data for a Machine Learning algorithm. This step is very crucial and takes up to 60 to 80 percent of time."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "labeled and unlabeled data",
  "patterns": 
  [
  "What is the difference between Labeled and Unlabeled data?",
  "differentiate between labeled and unlabeled data."
  ],
  "responses": 
  [
  "  Typically, unlabeled data consists of samples of natural or human-created artifacts that wecan obtain relatively easily from the world. Some examples of unlabeled data might include photos, audio recordings, videos, news articles etc. Labeled data typically takes a set of unlabeled data and augments each piece of that unlabeled data with some sort of meaningful 'tag', 'label', or 'class' that is somehow informative or desirable to know. For example, labels for the above types of unlabeled data might be whether this photo contains a horse or a cow, which words were uttered in this audio recording, what type of action is being performed in this video, what the topic of this news article is etc."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "features and labels",
  "patterns": 
  [
  "  What do you mean by Features and Labels in the dataset?",
  "define features and labels"
  ],
  "responses": 
  [
  "  Label: Labels are referred to as the final output. The output classes can also be considered as labels. When data scientists speak of labeled data what they mean is a group of samples whichhave been tagged to one or more labels.Feature: Features are defined as individual independent variables that act as input. Prediction models use features to make predictions. Moreover, you can also obtain new features from old features using a feature engineering method. Example- suppose we want to categorize our friends by their weight and height into different groups like obese, fit, underweight. Here, the inputs are weight and height which acts as a feature and the group names (fit, obese, underweight) which are the final outcome is the label. "
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "Noise",
  "patterns": 
  [
  " What do you mean by Noise in the dataset? ",
  "define noise in dataset",
  "define features and labels"
  ],
  "responses": 
  [
  " Noise is unwanted data items, features or records which don’t help in explaining the feature itself, or the relationship between feature & target. Noise often causes the algorithms to miss out patterns in the data  "
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": " imbalanced datasheet",
  "patterns": 
  [
  " What do you mean by Imbalanced Datasheet?",
  "define imbalanced datasheet",
  "how does imbalanced datasheet work?"
  ],
  "responses": 
  [
  "  Imbalanced dataset is relevant primarily in the context of supervised machine learninginvolving two or more classes.Imbalance means that the number of data points J.A.R.V.I.Silable for different the classes is different:If there are two classes, then balanced data would mean 50% points for each of the class. Formost machine learning techniques, little imbalance is not a problem. So, if there are 60% points for one class and 40% for the other class, it should not cause any significant performance degradation. Only when the class imbalance is high, e.g. 90% points for one class and 10% for the other, standard optimization criteria or performance measures may not be as effective and would need modification."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "Linear Discriminant Analysis",
  "patterns": 
  [
  "what is LDA?",
  "DEFINE LDA."
  ],
  "responses": 
  [
  "  Linear Discriminant Analysis or LDA is a dimensionality reduction technique. It is used as a pre-processing step in Machine Learning and applications of pattern classification. The goal of LDA is to project the features in higher dimensional space onto a lower-dimensional space in order to avoid the curse of dimensionality and also reduce resources and dimensional costs. "
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": " Gradient Descent",
  "patterns": 
  [
  "DEFINE GRADIENT Descent",
  "what is gradient descent"
  ],
  "responses": 
  [
  "  Gradient descent is an optimization algorithm used to minimize some function by iteratively moving in the direction of steepest descent as defined by the negative of the gradient. In machine learning, we use gradient descent to update the parameters of our model."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": " Regularization",
  "patterns": 
  [
  "   What is Regularization",
  "define regularization"
  ],
  "responses": 
  [
  " The word regularize means to make things regular or acceptable. This is exactly why we useit for. Regularizations are techniques used to reduce the error by fitting a function appropriately on the given training set and avoid overfitting."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "  Regularization in Machine Learning",
  "patterns": 
  [
  " When should one use Regularization in Machine Learning?"
  ],
  "responses": 
  [
  " At times when the model begins to underfit or overfit, regularization becomes necessary. It is a regression that diverts or regularizes the coefficient estimates towards zero. It reduces flexibility and discourages learning in a model to avoid the risk of overfitting. The model complexity is reduced and it becomes better at predicting. "
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": " Classification model",
  "patterns": 
  [
  " What is Classification model",
  " define classification model"
  ],
  "responses": 
  [
  " A classification model tries to draw some conclusion from the input valuesgiven for training. It will predict the class labels/categories for the new data."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": " issues to consider in supervised learning",
  "patterns": 
  [
  "What are the major issues to consider in supervised learning",
  "disadvantages of supervised learning"
  ],
  "responses": 
  [
  "There are four major issues to consider in supervised learning: Bias-variance tradeoff, Function complexity and amount of training data, Dimensionality of the input space, Noise in the output values "
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "algorithm is used best for supervised learning",
  "patterns": 
  [
  " What algorithm is used best for supervised learning?",
  "best algorithm for supervised learning"
  ],
  "responses": 
  [
  "A wide range of supervised learning algorithms are J.A.R.V.I.Silable, each with its strengths and weaknesses. There is no single learning algorithm that works best on all supervised learning problems."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": " standard supervised learning",
  "patterns": 
  [
  " In what ways can be standard supervised learning be generalized?",
  "types of supervised learning"
  ],
  "responses": 
  [
  "There are several ways in which the standard supervised learning problem canbe generalized: Semi-supervised learning: In this setting, the desired output values are provided only for a subset of the training data.The remaining data is labeled. Weak supervision: In this setting, noisy, limited, or imprecise sources are used to provide supervision signal for labeling training data."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "  applications of supervised learning",
  "patterns": 
  [
  " Give some applications of supervised learning.",
  " uses of supervised learning"
  ],
  "responses": 
  [
  "   Some applications of supervised learning are -Bioinformatics,spam detection,voice recognition, pattern recognition"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "     Support Vector Machine",
  "patterns": 
  [
  " Discuss about Support Vector Machine?",
  " define support vector machine"
  ],
  "responses": 
  [
  "In this algorithm, we plot each data item as a point in n-dimensional space (where n is a number of features you have) with the value of each feature being the value of a particular coordinate. "
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "advantages of supervised learning",
  "patterns": 
  [
  " What are the advantages of supervised learning?",
  " uses of supervised learning "
  ],
  "responses": 
  [
  "Advantages of supervised learning areSupervised learning allows you to collect data or produce a data output from the previous experience Helps you to optimize performance criteria using experience Supervised machine learning helps you to solve various types of real-world computation problems. "
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": " disadvantages of supervised learning",
  "patterns": 
  [
  "  What are the disadvantages of supervised learning?",
  "demerits of supervised learning"
  ],
  "responses": 
  [
  "Disadvantages of supervised learning areDecision boundary might be overtrained if your training set which doesn't have examples that you want to have in a class You need to select lots of good examples from each class while you are training the classifier."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "   Decision Trees",
  "patterns": 
  [
  "Discuss about Decision Trees ",
  "define decision trees"
  ],
  "responses": 
  [
  "Decision Trees (DT) are trees that classify instances by sorting them based on feature values, where each node in a decision tree represents a feature in an instance to be classified, and each branch represents a value that the node can assume. Instances are classified starting at the root node and sorted based on their feature values"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "K-Nearest Neighbor Algorithm",
  "patterns": 
  [
  "Explain K-Nearest Neighbor Algorithm",
  "define K-Nearest Neighbor Algorithm"
  ],
  "responses": 
  [
  "The k-nearest neighbour kernel density estimation method is a special type of the kernel density estimation method with the local choice of thebandwidth. An advantage of this estimator is that smoothing varies according to the number of observations in a particular region. The crucial problem is how to estimate the value of the parameter k. K is a kernel function which satisfies ∫ K(x) dx = 1 "
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "neural networks algorithms",
  "patterns": 
  [
  "define neural networks algorithms",
  "What are the neural networks algorithms?"
  ],
  "responses": 
  [
  "Neural nets take inspiration from the learning process occurring in human brains. They consists of an artificial network of functions, called parameters,which allows the computer to learn, and to fine tune itself, by analyzing new data. "
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "algorithms used by neural networks.",
  "patterns": 
  [
  " Name some algorithms used by neural networks. ",
  " what are the algorithms used for newral networks"
  ],
  "responses": 
  [
  "Gradient descent,  Newton’s method, Conjugate gradient"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "best practices for supervised learning",
  "patterns": 
  [
  "   Mention best practices for supervised learning."
  ],
  "responses": 
  [
  "Before doing anything else, you need to decide what kind of data is to be used as a training set.You need to decide the structure of the learned function and learning algorithm. Gathere corresponding outputs either from human experts or from measurements"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "self supervised learning",
  "patterns": 
  [
  "  What is self supervised learning",
  "  Define self supervised learning"
  ],
  "responses": 
  [
  "Self-supervised learning is a means for training computers to do tasks without humans providing labeled data (i.e., a picture of a dog accompanied by thelabel “dog”). It is a subset of unsupervised learning where outputs or goals are derived by machines that label, categorize, and analyze information on their own then draw conclusions based on connections and correlations"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": " applications of self-supervised learning",
  "patterns": 
  [
  "  what are the applications of self supervised learning?",
  "what are the uses of self supervised learning"
  ],
  "responses": 
  [
  "According to Yann Lecun, a computer scientist known for his impressive work in the ML field, the closest we have to self-supervised learning systems are the so-called “Transformers.” These are ML models that successfully use natural language processing (NLP) without the need for labeled datasets. They are capable of processing massive amounts of unstructured data and “transform” them into usable information for various purposes. The Transformers are behind Google’s BERT and Meena, OpenAI’s GPT2, and Facebook’s RoBERTa. "
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": " Polynomial Regression",
  "patterns": 
  [
  "  define polynomial regression",
  "what is polynomial regression",
  "Give an overview of Polynomial Regression"
  ],
  "responses": 
  [
  "Polynomial Regression is a form of linear regression in which the relationshipbetween the independent variable x and dependent variable y is modeled as an nth degree polynomial. Polynomial regression fits a nonlinear relationship between the value of x and the corresponding conditional mean of y, denoted E(y |x) "
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "using Polynomial Regression",
  "patterns": 
  [
  "why should we use polinomial regression?",
  "applications of polynomial regression"
  ],
  "responses": 
  [
  "There are some relationships that a researcher will hypothesize is curvilinear. Clearly, such type of cases will include a polynomial term. Inspection of residuals. If we try to fit a linear model to curved data, a scatter plot of residuals (Y axis) on the predictor (X axis) will have patches of many positive residuals in the middle. Hence in such situation it is not appropriate. An assumption in usual multiple linear regression analysis is that all the independent variables are independent. In polynomial regression model, this assumption is not satisfied."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": " advantages of using Polynomial Regression over Linear Regression",
  "patterns": 
  [
  "Mention some advantages of using Polynomial Regression over Linear Regression",
  "what are the advantages of using Polynomial Regression over Linear Regression"
  ],
  "responses": 
  [
  "Broad range of function can be fit under it. Polynomial basically fits wide range of curvature. Polynomial provides the best approximation of the relationship between dependent and independent variable."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": " Ridge Regression technique",
  "patterns": 
  [
  "Give an overview of Ridge Regression technique",
  "what is ridge regression technique"
  ],
  "responses": 
  [
  " Ridge Regression is a technique for analyzing multiple regression data that suffer from multicollinearity. When multicollinearity occurs, least squares estimates are unbiased, but their variances are large so they may be far from the true value. By adding a degree of bias to the regression estimates, ridge regression reduces the standard errors. It is hoped that the net effect will be to give estimates that are more reliable."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "importance of unsupervised learning",
  "patterns": 
  [
  "how important is unsupervised learning in the context of deep learning",
  "importance of unsupervised learning in the context of deep learning",
  "what is the role of unsupervised learning in deep learning"
  ],
  "responses": 
  [
  "Unsupervised learning is a machine learning technique, where we do not need to supervise the model. Instead, we need to allow the model to work on its own to discover information. It’s important to gain insight into the way the system behaves without supervision. For example, GAN, CNN, K-NN, etc.Deep learning can be either supervised or unsupervised. It all depends on how we want to use it. Deep learning is used for highly scalable datasets and algorithms which are complex for machine learning algorithms like SVM, Logistic Regression etc., to model. For example, Convolutional Neural Network (CNN) can be both supervised or unsupervised. If we want to classify images, we need to add dense layers and for classification, the training will be supervised. But, if we want to cluster images based on similarities of a group of images, we will extract the features using CNN and then use an unsupervised method like k-means or DBSCAN clustering."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "principle of Unsupervised Data Augmentation",
  "patterns": 
  [
  "Explain the principle of unsupervised data augmentation",
  "what is the wotrking principle of unsupervised data augmentation",
  "what is uda"
  ],
  "responses": 
  [
  "  Unsupervised Data Augmentation or UDA is a semi-supervised learning method which achieves state-of-the-art results on a wide variety of language and vision tasks. UDA is a method of semi-supervised learning, that reduces the need for labeled examples and better utilizes unlabeled ones"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "use of auto encoder",
  "patterns": 
  [
  "what is the use of auto encoders",
  "why auto encoders are uased when we already have more powerful dimension reduction techniques such as pca",
  "what is the advantage of auto encoders over pca ",
  "why auto encoders are used",
  "why auto encoders are used over pca"
  ],
  "responses": 
  [
  "Both PCA and Autoencoders are dimensional reduction techniques but Autoencoders are used more for detecting anomalies than for reducing data. Using Autoencoder, we try to reconstruct our data and then use reconstruction error to identify anomalous data points. This reconstruction is something that PCA is not very good at, especially when you have non-linear relationships among variables. Autoencoders, on the other hand, can use deep architecture to learn complex non-linear relationships as well."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "PCA or auto encoder",
  "patterns": 
  [
  "Which method extracts the better features for unsupervised learning: PCA or Auto Encoder",
  "which is better at extracting features for unsupervised learning",
  "which is better pca or auto encoder",
  "which method is more prefferable to extract features of unsupervised learning",
  "which method is good to implement features of unsupervised learning"
  ],
  "responses": 
  [
  " PCA will result in slower processing compared with an Autoencoder"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "use of unsupervised clustering models",
  "patterns": 
  [
  "how can we use unsupervised clustering models for classification tasks",
  "how can we implement unsupervised clustering models for classification tasks",
  "how unsupervised clustering models are used for classiification task",
  "use of unsupervised clustering models in classification tasks"
  ],
  "responses": 
  [
  "For supervised learning we need to have a labeled data set. If not, it is good to run unsupervised learning algorithms for automatically labeling unlabeled data. Once the data is labelled using clustering algorithms, then it is possible to use supervised learning algorithms. For linking the two tasks a simple script can be written that connect the output of clustering as an input for the classification task."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "techniques for anomaly detection on a dataset",
  "patterns": 
  [
  "mention some best techniques for anomaly detection on a dataset",
  "what are some of the best techniques to detect anomalies for a adatset having normal as well as abnormal behaviour",
  "What is the best unsupervised technique for Anomaly Detection for a dataset having normal as well as abnormal behaviour",
  "which clustering algorithms are best for detecting anomalies on a dataset having normal as well as abnormal behaviours"
  ],
  "responses": 
  [
  "We can use the following clustering algorithm - 1.)K-means/medoid 2.)Fuzzy c-means 3.)partition-based clustering"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "need of unsupervised learning",
  "patterns": 
  [
  "when do we need unsupervised learning",
  "when do we use unsupervised learning the most",
  "use of unsupervised learning"
  ],
  "responses": 
  [
  " In unsupervised learning, we do not have a supervisor which tells us what is right and what is wrong i.e. we do not have input data with example output data where we want to learn the input/output relation. In general, we use unsupervised learning when we want to find general structures in our data. for example- major trends, a low-dimensional embedding or clustering."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "unsupervised learning algorithm for categorical data",
  "patterns": 
  [
  "which algorithm of unsupervised machine learning can be applied to categorical data",
  "name an algorithm based on unsupervised learning that can be used on categorical data",
  "What are the unsupervised machine learning algorithms which can be applied on categorical data"
  ],
  "responses": 
  [
  " K-means algorithm can be used to generate labelled/categorical of data "
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "types of clustering methods",
  "patterns": 
  [
  "What are the different types of clustering methods",
  "mention some clustering methods",
  "list some of the different types of clustering methods"
  ],
  "responses": 
  [
  "Different types of clustering methods are -   Density-based methods, Hierarchical based method, Partitioning methods, Grid-based methods"
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "Density based lagorithms",
  "patterns": 
  [
  "explain how density based algorithm works",
  "explain the working of density based algorithms",
  "how density based algorithms works"
  ],
  "responses": 
  [
  "These methods consider the clusters as the dense region having some similarity and different from the lower dense region of the space. These methods have good accuracy and ability to merge two clusters. Example:  DBSCAN (Density-Based Spatial Clustering of Applications with Noise), OPTICS (Ordering Points to Identify Clustering Structure) etc."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "hierarchical clustering based method",
  "patterns": 
  [
  "how hierarchical based clustering algorithm works",
  "explain the hierarchical based clustering algorithm",
  "explain the working of hierarchical based clustering algorthm"
  ],
  "responses": 
  [
  "The clusters formed in this method forms a tree-type structure based on the hierarchy. New clusters are formed using the previously formed one. It is divided into two categories:1.)Agglomerative (bottom up approach) 2.)Divisive (top down approach) for example: CURE (Clustering Using Representatives), BIRCH (Balanced Iterative Reducing Clustering and using Hierarchies) etc."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "partitioning clustering method",
  "patterns": 
  [
  "explain the partitioning clustering methods",
  "explain the working of partitioning clustering methods",
  "how the partitioning clustering methods works"
  ],
  "responses": 
  [
  " These methods partition the objects into k clusters and each partition forms one cluster. This method is used to optimize an objective criterion similarity function such as when the distance is a major parameter example K-means, CLARANS (Clustering Large Applications based upon Randomized Search) etc."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "grid-based clsutering methods",
  "patterns": 
  [
  "explain the grid based clustering methods",
  "how grid based methods works",
  "explain the algorithms based on grid based clustering methods"
  ],
  "responses": 
  [
  "In this method the data space is formulated into a finite number of cells that form a grid-like structure. All the clustering operation done on these grids are fast and independent of the number of data objects example STING (Statistical Information Grid), wave cluster, CLIQUE (Clustering in Quest) etc."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag":"use of KNN algorithm",
  "patterns": 
  [
  "when do we use knn algorithm",
  "when do we need knn algorithm",
  "when it is prefferable to use knn algorithm"
  ],
  "responses": 
  [
  "KNN can be used for both classification and regression predictive problems. However, it is more widely used in classification problems in the industry. To evaluate any technique, we generally look at 3 important aspects: 1. Ease to interpret output 2. Calculation time  3. Predictive Power. KNN algorithm fairs across all parameters of considerations. It is commonly used for its easy of interpretation and low calculation time."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "use of KNN algorithm",
  "patterns": 
  [
  "when do we need knn algorithm",
  "what is the use of knn algorithm",
  "when is it prefferable to use knn algorithm"
  ],
  "responses": 
  [
  "KNN can be used for both classification and regression predictive problems. However, it is more widely used in classification problems in the industry. To evaluate any technique, we  enerally look at 3 important aspects: 1. Ease to interpret output  2. Calculation time  3. Predictive Power.  KNN algorithm fairs across all parameters of considerations. It is commonly used for its easy of interpretation and low calculation time."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "working of knn algorithm",
  "patterns": 
  [
  "how does the knn algorithm works",
  "explain the working of knn algorithm",
  "explain the knn algorithm"
  ],
  "responses": 
  [
  " Let’s take a simple case to understand this algorithm. Lets say there is a spread of red circles (RC) and green squares (GS) and you intend to find out the class of the blue star (BS). BS can either be RC or GS and nothing else. The “K” in KNN algorithm is the nearest neighbor we wish to take the vote from. Let’s say K = 3. Hence, we will now make a circle with BS as the center just as big as to enclose only three datapoints on the plane. The three closest points to BS are all RC. Hence, with a good confidence level, we can say that the BS should belong to the class RC. Here, the choice became very obvious as all three votes from the closest neighbor went to RC. The choice of the parameter K is very crucial in this algorithm. Next, we will understand what are the factors to be considered to conclude the best K."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "disadvantages of knn algorithm",
  "patterns": 
  [
  "what are the disadvantges of using knn algorithm",
  "what can be the reasons for not using knn algorithm",
  "list some of the disdJ.A.R.V.I.Sntages of knn algorithm"
  ],
  "responses": 
  [
  " Disadvantages of KNN algorithm are: The algorithm gets significantly slower as the number of examples and/or predictors/independent variables increase."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "working of k-means algorithm",
  "patterns": 
  [
  "explain the k-means algorithm",
  "explain the working of k-means algorithm",
  "how does the k-means algorithm works"
  ],
  "responses": 
  [
  " To process the learning data, the K-means algorithm in data mining starts with a first group of randomly selected centroids, which are used as the beginning points for every cluster, and then performs iterative (repetitive) calculations to optimize the positions of the centroids It halts creating and optimizing clusters when either: 1.)The centroids have stabilized — there is no change in their values because the clustering has been successful. 2.)The defined number of iterations has been achieved."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "advantages of k-means algorithm",
  "patterns": 
  [
  "what are some of the advanatges of k-means algorithm",
  "mention some advanatges of k-means algorithm",
  "what are some of the good points of using k-means algorithm",
  "what are the advanatges of k-means algorithm"
  ],
  "responses": 
  [
  " The advantages of K-means algorithm are -   1.)Relatively simple to implement.  2.)Scales to large data sets.  3.)Guarantees convergence. 4.)Can warm-start the positions of centroids.  5.)Easily adapts to new examples. 6.) Generalizes to clusters of different shapes and sizes, such as elliptical clusters."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "disadvantges of using k-means",
  "patterns": 
  [
  "mention some of the disadJ.A.R.V.I.Sntages of k-means algorithm",
  "list some diadvantages of k-means algorithm",
  "what are the disadvantages of k-means algorithm",
  "what can be the possible reasons for not using k-means algorithm"
  ],
  "responses": 
  [
  " The disadvantages of K-means algorithm are: 1.) Clustering data of varying sizes and density. 2.) Choosing k manually. 3.) Clustering outliers: Centroids can be dragged by outliers, or outliers might get their own cluster instead of being ignored. Consider removing or clipping outliers before clustering. 4.)Scaling with number of dimensions: As the number of dimensions increases, a distancebased similarity measure converges to a constant value between any given examples. 4.)Reduce dimensionality either by using PCA on the feature data, or by using “spectral clustering” to modify the clustering algorithm."
  ],
  "context": 
  [
  ""
  ]
  },
  {
  "tag": "advantages of knn algorithm",
  "patterns": 
  [
  "what are the advanatges of knn algorithm",
  "mention some of the advanatges of knn algorithm",
  "what are the benefits of using knn algorithm",
  "what are some of the characteristics that can be considered as advanatges of knn algorithm"
  ],
  "responses": 
  [
  "The advantages of KNN algorithm are –  1.)The algorithm is simply and easy to implement, 2.)There’s no need to build a model, tune several parameters, or make additional assumptions 3.)The algorithm is versatile. It can be used for classification, regression, and search."
  ],
  "context": 
  [
  ""
  ]},
   {"tag": "name",
    "patterns": ["what is your name", "what should I call you", "whats your name?"],
    "responses": ["You can call me JARVIS", "I'm JARVIS!", "I'm JARVIS, here to help you!"]
   },
   {"tag": "Internship eligibility",
    "patterns": ["WHO IS ELIGIBLE TO APPLY FOR INTERNSHIPS UNDER TULIP?", "how to apply for internship", "Am i eligible for this internship","what is the eligibility criteria for the internship","i want to apply for Tulip internship"],
    "responses": ["The internships under TULIP are open to Indian Citizens who have completed a diploma/graduate/postgraduate program. Candidates should, however, note that at the time of application they have not crossed 36 months from the date of results declaration of diploma/graduation.", "It is open to courses and streams as prescribed by ULBs/Smart Cities in their requirements. Both AICTE affiliated and non-AICTE college graduates are eligible to apply. Candidates who have taken all the final semester exams of final year and are awaiting results shall proceed with their applications and join internships. However, the release of their internship certificates will be subject to production of education certificate(s)/degree to their respective ULBs/Smart Cities/Parastatal authorities."]
 
   },
   {"tag": "TULIP",
    "patterns": ["What is TULIP ?", "What does TULIP do ?", "Is TULIP an internship program ?"],
    "responses": ["The TULIP platform is a dedicated window to internship opportunities in Urban Local Bodies/smart cities.",
    "The TULIP platform aggregates opportunities from across India for graduates on a single platform and allow them to apply for internships in the domain of urban governance."]
 
   },
   {"tag": "Stipend",
    "patterns": ["Is there any stipend?", "How much can I earn?", "Is the internship free or stipend based ?","will i earn money from this internship","will i get stipend","does tulip internship provide stipend"],
    "responses": ["The stipend and its amount are under the scope and purview of the specific ULB/smart city one is applying to. Any stipend or allowance amount, if provided or not, will be mentioned in the perks and allowances section of the internship posted by the ULB/smart city.",
    "TULIP allows for both paid and unpaid internships, though we recommend that candidates should apply for the internships considering the potential for learning as opposed to the stipend amount.",
    "Any stipend or allowance amount, if provided or not, will be mentioned in the perks and allowances section of the internship. Internships are best looked at as learning opportunities and candidates should treat them as such."]
 
   },
   {"tag": "Certificate",
    "patterns": ["Will I receive an Internship certificate?", "How will I get internship certificate?", "What are the benefits of completing internship?"],
    "responses": ["The internship certificate issued upon successful completion of the internship is a digitally verifiable and secure one.",
    "The candidates upon successful completion of internship will receive an internship certificate, which will be verifiable using a QR code"]
 
   },
   {"tag": "Selection Process TULIP",
    "patterns": ["What is the selection process for TULIP?", "Will my application get selected?", "How are candidates selected for internship?","what is the selection criteria for TULIP internship"],
    "responses": ["After completing the application on the TULIP platform, the candidate can apply for up to 7 internship requirements at a given point of time. Once candidate is screened/shortlisted, he/she may be invited by the ULB/smart city for an interview.",
    "After a candidate is shortlisted, he/she will have to appear for an online/offline interview.The candidates selected through the interview will be notified by the ULB/smart city and will be issued the offer letter digitally. The candidate may then choose to accept or reject the internship offer on the portal itself."]
 
   },
   {"tag": "Document Requirements",
    "patterns": ["What documents are required for TULIP ?", "Which documents need to be submitted for TULIP ?", "How do I apply for TULIP internship ?","documents required", "documents needed","which documents are required","which documents do i need"],
    "responses": ["A Govt. issued identity proof (Driving License, Election Card, etc.), proofs of academic qualifications and a letter of recommendation from academic mentors of the student are the basic requirements for an internship for TULIP.",
    "List of documents is as follows: Govt. issued ID proof, proof of academic qualifications, a letter of recommendation from academic mentors."]
 
   },
   {"tag": "Approval Process",
   "patterns": [" Where I can find the information related to Approval Process 2020-21","approval process","approval process 2021","approval process 2020","what is the approval process of colleges"],
   "responses": ["Information related to Approval Process 2020-21 J.A.R.V.I.Silable on AICTE Website's Homepage>Quick Links>Approval Process 2020-21.",
                 "On AICTE Website's Homepage>Quick Links>Approval Process 2020-21."]

   },
   {"tag": "New User-id and password",
   "patterns": [" How can I get New User-id and password (login credentials) for AICTE Web Portal","New User-id and password","new login credentials","new username and password","how to create account","how to sign up"],
   "responses": ["Please click on Sign Up link on AICTE Web-portal or go to link http://portal.aicte-india.org/partnerportal_enu. User Manual for Obtaining USERNAME and PASSWORD @https:/aicte-india.org/bureaus/approval/ap_2020-21 "]

   },
   {"tag": "Forgot Password",
   "patterns": [" I have forgotten password for logging in AICTE Web Portal. What is the procedure to recover this",
                "new password","recover password","i forgot my password"],
   "responses": ["Please refer User Manual for Forgotten Password J.A.R.V.I.Silable @ https://aicte-india.org/bureaus/approval/ap_2020-2"]

   },
   {"tag": "UserId for forgoten password",
   "patterns": [" Is User Id field mandatory for Forgot Password form",
                "do i need to have a user id for password recovery","Is User Id field compulsory for Forgot Password form"],
   "responses": ["No, User Id is NOT mandatory. Only Permanent Institute Id is required for existing institute. In case of new institute (received Letter of Approval(LOA) in previous year) can enter Current Application Id. "]

   },
   {"tag": "Error Password",
   "patterns": ["When I try to login with Institute's Credentials, error message Invalid Username and Password is displayed. What should I do",
                "Invalid Username and Password is displayed What should I do", "error while logging in"],
   "responses": ["Recheck the login credentials. Confirm whether someone else has logged ino with the same credentials (Please note that per institute only ONE session is allowed. Hence, if someone tries  for 2nd session then again invalid user name and password message will popup). If no session is live and still getting an invalid username and password message, then the password might be incorrect. In such cases, you can Request for forgot password."]

   },
   {"tag": "generate report",
   "patterns": [" I am not able to generate report", "How do i generate report","How can i create report","i want to create report"],
   "responses": ["Please login to AICTE Webportal using your institute’s login credentials then click on  Approval Process icon. Follow the instructions given in User Manuals/Videos and apply  accordingly. For more information, please go through Approval Process Handbook 2020-21."]

   },
   {"tag": "Delete details",
   "patterns": ["How to delete old faculty details", "i want to remove old faculty details","i want to delete old faculty data", "remove old faculty details"],
   "responses": ["Faculty record cannot be deleted. Faculty can be marked as Duplicate or Left the Institute under HOI & Faculty Details tab"]

   },
   {"tag": "Update faculty details",
   "patterns": ["Is Aadhaar/PAN details mandatory to update faculty details in AICTE Web Portal","Aadhaar/PAN necessary/required to update teacher details","is aadhar or pan mandatory for updating details"],
   "responses": ["Aadhar and Pan are mandatory to update faculty details."]

   },
   {"tag": "Transfer faculty record",
   "patterns": [" How to transfer faculty record(individual) from one institute to another institute","how to transfer or move teacher details from one institute to another institute", "i want to transfer faculty details"],
   "responses": ["This facility is J.A.R.V.I.Silable under HOI & Faculty tab. Before transferring any individual faculty record from one institute to other institute, the faculty should be compulsorily marked as left the institute in the previous institute. "]

   },
   {"tag": "PG Scholarship Eligibility",
    "patterns": ["What are the eligibility criteria for grant of PG Scholarship?", "How to apply for PG Scholarship?",
    "Are the students qualifying GATE/GPAT exam after seeking admission in the course, eligible for grant of PG Scholarship ?",
    "Am i eligible for this scholarship?","Who are eligible to PG Scholarship","PG scholarship eligibility","I want to apply for PG scholarship","Can i apply for pg scholarship","Am  eligible for PG scholarship"],
    "responses": ["Post Graduate Scholarship is entitled only to full time GATE/GPAT qualified students admitted to AICTE approved programs viz. Master of Engineering, Master of Technology, Master of Architecture and Master of Pharmacy courses in AICTE approved Institutions and AICTE approved University Departments. Any student who qualifies the GATE/GPAT exam after the date of admission shall not be eligible for grant of scholarship for the reasons whatsoever it may be."]
 
   },
   {"tag": "Online Procedure of PG scholarship through DBT",
   "patterns": ["What is the procedure for applying online for grant of PG Scholarship through DBT?", 
   "What is the online procedure for grant of PG Scholarship through DBT?","PG DBT Scholarship","i want to apply for PG Scholarship through dbt","how to apply for pg scholarship through dbt"],
   "responses": ["Proposal for grant of PG Scholarship are called for through advertisement in leading newspapers. Students/Institutes are advised to follow the procedure and guidelines contained therein. Copy of the advertisement can be viewed by visiting AICTE portal at http:www.aicte-india.org/bulletin.php"]

   },
   {"tag": "Documents Required for PG scholarship",
   "patterns": ["What are the document required to be uploaded by the student for PG scholarship?","Which documents need to be submitted for pg scholarship?","pg scholarship documents","which documents are required for pg scholarship","what documents do i need to upload for pg scholarship"],
   "responses": ["Students are required to upload to following documents: a) Scanned PDF copy of GATE/GPAT score card. b) Scanned PDF copy of the passbook c) Scanned PDF copy of the Aadhaar card. Students of J&K, Meghalaya and Assam are exempted. d) Scanned PDF copy of caste certificate. e) Scanned PDF copy of the Non-Creamy Layer (NCL) certificate in respect of only OBC candidates. Non-Creamy Layer (NCL) should not be old more than 1 year."]

   },
   {"tag": "Joint Account approval",
   "patterns": ["Can the Joint Account with family members be uploaded? (The PDF copy of the same.)","Joint account family"," is a joint family account accepted"],
   "responses": ["No, Joint account is not accepted. Only Basic General Savings account/Normal account should be opened in the name of the student in any Nationalized bank. Student should open “ NO FRILL ACCOUNT"]

   },
   {"tag": "Bank Account Updation",
   "patterns": ["During the period of the course can a student open a fresh Bank account or change the Branch of Savings Bank account.","Bank account updation","Change branch of bank"],
   "responses": ["Bank and Branch should not be changed during the period of course preferably for smooth disbursal of PG scholarship."]

   },
   {"tag": "Portal Data Visibility",
   "patterns": ["The data on the portal is submitted for the purpose of grant of PG Scholarship but it is not visible on the portal. What can the reasons be thereof.","Data not visible on portal","Submitted but not visible"," I submitted details on portal but they are not visible"],
   "responses": ["Every data/attendance uploaded by the student/Institution is required to be submitted by pressing “Submit Application” button. Check up with your Institution whether “submit application” button has been pressed or not while submitting the data."]

   },
   {"tag": "Non-sponsored categories/Management quota/foreign students Eligibility",
   "patterns": ["Whether students from non-sponsored categories/Management quota/foreign students are eligible for grant of PG Scholarship?","non sponsored categories management quota eligibility","Can a student from non sponsored, management quota or foreign student apply for PG scholarship"],
   "responses": ["No, Students from non-sponsored categories/Management quota/foreign students admitted with valid GATE/GPAT Score card are not eligible for grant of PG Scholarship."]

   },
   {"tag": "Part time courses eligibility",
   "patterns": ["Whether the PG Scholarship is admissible to the GATE/GPAT qualified student admitted in part time courses?","I am a GATE GPAT student, can i apply for part time scholarship scholarship", "Are gate or gpat students eligible for part time scholarship"],
   "responses": ["No, PG Scholarship is admissible to the GATE/GPAT qualified students, admitted only in full time course."]

   },
   {"tag": "State Government or Central Government sponsored schemes eligibility",
   "patterns": ["Whether a student who is recipient of Scholarship either through State Government or Central Government sponsored schemes is eligible for grant of PG scholarship?", "State government pg scholarship","Central government pg eligibility"],
   "responses": ["No, the student who is in receipt of any kind of Scholarship/Stipend or salary etc. is not eligible for grant of PG Scholarship."]

   },
   {"tag": "Add/Update faculty details",
   "patterns": ["How to update/add the faculty details by import method?", "What is the procedure of adding/updating faculty details by import method","i want to update faculty details using import method","how to use import method for updating faculty details"],
   "responses": ["Please follow the User Manual J.A.R.V.I.Silable @ https://aicte-india.org/bureaus/approval/ap_2020-21 for uploading faculty details by import method"]

   },
   {"tag": "Online Payment",
   "patterns": ["I have made Online Payment but amount is not updated in portal.", "Why is the amount not updated in the portal after i made my payment","Payment done but not reflected in portal","I have completed payment but it is not reflected in the portal"],
   "responses": ["Generally, payment receipt gets updated immediately. In case, your payment receipt is not updated then click on View Transaction Button under Payment tab. Otherwise, it will get updated in 48 to 72 working hours (2 to 3 working days). In case it is not updated even after that, please raise grievance with transaction details (Transaction Id generated while making the payment) through Online Grievance Redressal form. Link is J.A.R.V.I.Silable on Approval Process 2020-21 page."]

   },
   {"tag": "AICTE Website Payment Gateway",
   "patterns": ["I am not able to make payment because AICTE Website is not directing to Payment Gateway.", "I am unable to continue with the payment as Payment Gateway is not opening","Payment gateway error","payment gateway not opening","I am not able to make payment","I am getting error for payment gateway"],
   "responses": ["Please check whether your application has been submitted successfully or not. If submitted, then allow Popups for AICTE Website through Web browser URL."]

   },
   {"tag": "Academic Year 2020-21",
   "patterns": ["Where to send the queries related to portal, payment and approval related issues for the Academic Year 2020-21?", "Where can i post queries related to Academic Year 2020-21?", "Where can i ask questions related to portal, payment and approval for the Academic Year 2020-21?","I want to post query regarding portal  payment and approval"],
   "responses": ["Raise a Grievance via grievance form J.A.R.V.I.Silable at https://www.facilities.aicteindia.org/Approval Process/apformEmail.php."]

   },
   {"tag": "User ID ",
   "patterns": ["Our Institution was allotted a User ID last year as a new Institution. Some information was uploaded but the application could not be submitted at that time. Now I want to know that the same User ID can be used for approval process 2020-21. ", "Can i use the user-id generated for approval process of the academic year 2019-20 for the academic year 2020-21","can i use previous year login credential for this year approval process","Can login credentials of previous year be used again for approval process"],
   "responses": ["No, Institute need to apply afresh for getting login credentials."]

   },
   {"tag": "Details",
   "patterns": ["We want to change details which are non-editable / read-only? ", "How to change non-editable/read-only details"," I want to change non editable, read only details"],
   "responses": ["You may contact the Approval Bureau or Regional Office."]

   },
   {"tag": "Application",
   "patterns": ["By mistake, I have submitted my application. Is it possible to reopen the application once again to update the few details?", "How can i update my application after submitting it?", "Is it possible to re-open my application to make changes after it was submitted?","Can i make changes to an application which was submitted" , "I want to make changes to a submitted application"],
   "responses": ["If you have not created any payment record under Payment tab then you can re-open the submitted application only once by clicking on “re-open application” button J.A.R.V.I.Silable under Attachments and Submit tab.  Note: After re-open, the application should be resubmitted. Otherwise application will be treated as 'Application Not Submitted'."]

   },
   {"tag": "Password",
   "patterns": ["I have applied for forgot password but still I did not receive password on my registered email?", "Where will my password be sent after clicking on forget password?", "I have forgotten my password, how can i get it back?","I forgot my password, can i recover it "],
   "responses": ["Institute need to submit the Affidavit-1 in the respective Regional Office. Regional Officer will flag the Affidavit Received against your request on web portal. Then password will be sent to the institute’s registered email id. Please check the Spam Folder also in your mailbox for forgot password email. In case of any issue, you may raise your grievance online by Grievance link J.A.R.V.I.Silable @ https://aicte-india.org/bureaus/approval/ap_2020-21"]
   }
  ]
}
